[
  {
    "author": "@ap0110",
    "text": "the title of the sequel should be Duly. badum tss",
    "publishedAt": "2024-02-22T09:29:18Z"
  },
  {
    "author": "@chipwilliams5854",
    "text": "Dune is highly overrated, and the world building is uhhhhh.... lame? And nonsensical? Maybe i missed the point of the books, but, ehhhh....mehhh... its... certainly people on a sand planet... don't understand why there was a need for 3 books, a decent 80's adaptation, and then further, a re-re-remake.\n\nZendaya COLEMAN, yes she has a past name, she is, fine... in this film. Timothy shimbabbaramadom or whatever his name is, he's okay i guess. Jeremy suckin the peen a little too much on this one",
    "publishedAt": "2024-02-22T09:21:03Z"
  },
  {
    "author": "@JohnDoe-wq5eu",
    "text": "What's going to be probably one of the best movies of 2024 is weird to say considering it should have been the best movie of 2023. I hope there's more surprises this year but I'm not too sure what with the events of last year.",
    "publishedAt": "2024-02-22T09:12:13Z"
  },
  {
    "author": "@taydestiny38",
    "text": "Thank You Sir! Honest and forthcoming review with no B.S. attached to appease the masses.",
    "publishedAt": "2024-02-22T09:09:57Z"
  },
  {
    "author": "@louisblackforester",
    "text": "D- for costumes and set-design !",
    "publishedAt": "2024-02-22T09:02:24Z"
  },
  {
    "author": "@mad2403",
    "text": "well of course it has a religious tone cause it is heavily based on Islam",
    "publishedAt": "2024-02-22T09:01:35Z"
  },
  {
    "author": "@BigSteelThrill",
    "text": "this sucks, too much \"look at me\"",
    "publishedAt": "2024-02-22T08:53:25Z"
  },
  {
    "author": "@Dont-Ask-Me-My-Name",
    "text": "I loved the OG film from 1984 but I haven't seen Dune Part 1 yet.  I was waiting for Dune Part 2 to come out &I am absolutely going to watch Part 1 &then hit the I-Max for Part 2.  After Kill Bill vol 2 I told myself never again am I doing this Part 1 and then Part 2 not when it's the plan from the beginning nope.  Glad everyone that I watch/listen to is saying that the film is great &I absolutely agree that Greig Fraser is the best cinematographer in the business.  In my mind he's fighting with the great Wally Pfister for best cinematographer of the last 40 years w/ Nolan's new guy the only other one that is even in the conversation",
    "publishedAt": "2024-02-22T08:53:06Z"
  },
  {
    "author": "@RSRtwothousand5",
    "text": "Love the murph watch Jeremy 👍",
    "publishedAt": "2024-02-22T08:51:36Z"
  },
  {
    "author": "@NoobCraftCasting",
    "text": "did like dune part 1 not gonna watch part 2\n2",
    "publishedAt": "2024-02-22T08:40:17Z"
  },
  {
    "author": "@rrppodcast3347",
    "text": "I will binge.",
    "publishedAt": "2024-02-22T08:32:28Z"
  },
  {
    "author": "@anasshahid224",
    "text": "Great review Jeremy, Dune 1 was a treat, loved the world building, visuals, cinematography, everything was a treat, excited for Dune Part 2 😊",
    "publishedAt": "2024-02-22T08:22:07Z"
  },
  {
    "author": "@kal-nor",
    "text": "I felt like this review was done without the reviewer knowing there’s a part 3. It’s just the impression I get but makes me wonder how part 2 finishes. I can’t wait to watch it and find out.",
    "publishedAt": "2024-02-22T08:21:46Z"
  },
  {
    "author": "@runkurgan",
    "text": "5:39 thank you",
    "publishedAt": "2024-02-22T08:16:46Z"
  },
  {
    "author": "@louisduarte8763",
    "text": "Something I don't get about DUNE's Spice (a.k.a. Space Meth): is it Sandworm poop?",
    "publishedAt": "2024-02-22T08:10:19Z"
  },
  {
    "author": "@RtB68",
    "text": "Ahh-RAH-kis   Please.   Not Ahh-RAK-kis.  😅",
    "publishedAt": "2024-02-22T08:07:42Z"
  },
  {
    "author": "@dybcreations",
    "text": "It’s crazy how all three versions are wildly different but they are all amazing in different ways! I think it’s a great example of how a source material can be interpreted differently but still can all be valid adaptations",
    "publishedAt": "2024-02-22T08:06:32Z"
  },
  {
    "author": "@dice268926",
    "text": "Appreciated",
    "publishedAt": "2024-02-22T08:03:39Z"
  },
  {
    "author": "@4kfrank276",
    "text": "It better be the end of the series. I didn't know it was a sequel in the first Dune until the opening title, and if this is a sequel to a trilogy I'm passing on it.",
    "publishedAt": "2024-02-22T07:55:37Z"
  },
  {
    "author": "@McGarva97",
    "text": "What about the beast rabban did he get much screen time ?",
    "publishedAt": "2024-02-22T07:54:04Z"
  },
  {
    "author": "@ccan_max5285",
    "text": "Seriously looking forward to seeing this",
    "publishedAt": "2024-02-22T07:47:46Z"
  },
  {
    "author": "@samuellee257",
    "text": "I really hope Denis Villeneuve is able to direct the rest of the Dune Universe, he is the only one who can properly adapt a great book to the big screen.",
    "publishedAt": "2024-02-22T07:43:53Z"
  },
  {
    "author": "@raywalsh9152",
    "text": "Okay, how about if you really enjoy sci-fi books and movies, but you never took the time to read Dune, and you are almost 60 years old, so you remember the first movie, and it was pretty good, you enjoyed it, but your entire existence doesn't revolve around whether the movie adaptation captured the novel perfectly. Should I watch it? I have held off on watching part 1 until part 2 came out. So I'm looking at around 8 hours of movie watching, with drink runs and bathroom breaks. Which is fine, but ... Anyway, just asking for a friend. I'm more of a Woody Allen kinda guy.",
    "publishedAt": "2024-02-22T07:40:44Z"
  },
  {
    "author": "@zachariusthethird6627",
    "text": "Bro you suck at movie reviews. Just give up. Also your impersonations are cringe x10000",
    "publishedAt": "2024-02-22T07:36:57Z"
  },
  {
    "author": "@ruirengan",
    "text": "Hi. Would love to hear your reaction to the new borderlands trailer",
    "publishedAt": "2024-02-22T07:23:55Z"
  },
  {
    "author": "@TrupimOkiemTV",
    "text": "I loved Dune part 1. I saw it four times in cinema and enjoyed every moment of it.",
    "publishedAt": "2024-02-22T07:08:06Z"
  },
  {
    "author": "@chintanbankar5305",
    "text": "greg fraizer looks like he played reverse flash on the cw show",
    "publishedAt": "2024-02-22T07:05:48Z"
  },
  {
    "author": "@raddishtt",
    "text": "Greg Greg Greg",
    "publishedAt": "2024-02-22T07:04:38Z"
  },
  {
    "author": "@IanM-id8or",
    "text": "I hope they get as far as making a movie of God Emperor.  That's the book that the series is all about",
    "publishedAt": "2024-02-22T07:01:24Z"
  },
  {
    "author": "@Zarrus",
    "text": "Can't wait to see it!!!",
    "publishedAt": "2024-02-22T06:55:00Z"
  },
  {
    "author": "@darrenanderson2031",
    "text": "Can’t tell if he just called them the Ha-Conan’s satirically or what 😅",
    "publishedAt": "2024-02-22T06:43:50Z"
  },
  {
    "author": "@ShadowDzver",
    "text": "As a watch enthusiast myself, it`s great to see the Hamilton love yet again, given the watch brands history being entwined into cinema, it`s quite poetic sharing both passions. I`m sure we will enjoy part two.",
    "publishedAt": "2024-02-22T06:38:53Z"
  },
  {
    "author": "@SageRap",
    "text": "It feels like you're talking to someone over my left shoulder. Looking at yourself in the monitor the whole time, or a teleprompter I'm guessing?",
    "publishedAt": "2024-02-22T06:32:05Z"
  },
  {
    "author": "@KODIAK-ij4yg",
    "text": "The old Movie and Sci-fi Miniseries is all I need!!! Well I didn't like Part one and so I won't be watching Part two😂😂😂",
    "publishedAt": "2024-02-22T06:29:20Z"
  },
  {
    "author": "@lesath7883",
    "text": "I need to watch this.\nOn the cinema.",
    "publishedAt": "2024-02-22T06:25:57Z"
  },
  {
    "author": "@jonascastejon5888",
    "text": "Heretics Of Dune is my favorite Dune book 📚 and to me the best book in the series, followed closely by God Emperor.\n\nOne can only dream Denis bring those books to the big screen.",
    "publishedAt": "2024-02-22T06:22:38Z"
  },
  {
    "author": "@Cybertron-cs7sk",
    "text": "Jeremy and Drinker the modern Siskel and Ebert 2 thumbs up 👍 for my 2 favourite reviewers.",
    "publishedAt": "2024-02-22T06:16:58Z"
  },
  {
    "author": "@7dano523",
    "text": "Marvel should have waited for Denis to do Fantastic four....Also I would love him to do a Black Hole remake",
    "publishedAt": "2024-02-22T06:15:50Z"
  },
  {
    "author": "@antoniovelcovici9131",
    "text": "Imagine if he directed the star wars sequel trilogy",
    "publishedAt": "2024-02-22T06:15:13Z"
  },
  {
    "author": "@acpscreations1334",
    "text": "His expressions in the thumbnails of both movies seem like consecutive frames of the same excited emotion.",
    "publishedAt": "2024-02-22T06:15:06Z"
  },
  {
    "author": "@RVR121",
    "text": "Actual story telling? in modern hollywood sci fi...you'd almost say this is a prank call.",
    "publishedAt": "2024-02-22T06:08:05Z"
  },
  {
    "author": "@wellsaidgoodheadfred9843",
    "text": "are you going to do drive-away dolls?",
    "publishedAt": "2024-02-22T05:54:39Z"
  },
  {
    "author": "@patrickday4206",
    "text": "I can't wait for the extended editions like lotr 15 hours of movie 😂",
    "publishedAt": "2024-02-22T05:51:40Z"
  },
  {
    "author": "@patrickday4206",
    "text": "Nice walken impression 😊",
    "publishedAt": "2024-02-22T05:50:22Z"
  },
  {
    "author": "@yayap5631",
    "text": "Yooo is it possible for you to review the Japanese movie Character? Not sure if you did it or not.",
    "publishedAt": "2024-02-22T05:49:47Z"
  },
  {
    "author": "@connoriquada5429",
    "text": "Bro I forgot this movie even existed. I haven’t seen any advertisements for it whatsoever. I didn’t realize it was already out. Or coming out so soon. Or whatever 😂",
    "publishedAt": "2024-02-22T05:44:15Z"
  },
  {
    "author": "@HindiRapGuru",
    "text": "Dune is the most BORING sci-fi film I have ever seen in my life!",
    "publishedAt": "2024-02-22T05:30:56Z"
  },
  {
    "author": "@giovanniamador239",
    "text": "I wasn't impressed with doing part 1 , so I don't know if I should go and watch them part 2",
    "publishedAt": "2024-02-22T05:29:45Z"
  },
  {
    "author": "@gsurveil1",
    "text": "David Lynch?",
    "publishedAt": "2024-02-22T05:20:38Z"
  },
  {
    "author": "@darthscipio5289",
    "text": "I'm getting the feeling the Cinematography will be a ripoff of the Cinematography from LAWRENCE OF ARABIA as the book Dune is also a ripoff of Lawrence of Arabia",
    "publishedAt": "2024-02-22T05:15:48Z"
  },
  {
    "author": "@user-hc9ly8fl1r",
    "text": "Did the movie end where the book did or will there be a part 3?",
    "publishedAt": "2024-02-22T05:10:24Z"
  },
  {
    "author": "@killingtimeslowly1",
    "text": "Extremely jealous you got to see this masterpiece early. 😭😭😭😭😭",
    "publishedAt": "2024-02-22T05:04:20Z"
  },
  {
    "author": "@HoutrXuero",
    "text": "Ah my most trusted source, the villain from Madame Web",
    "publishedAt": "2024-02-22T04:57:19Z"
  },
  {
    "author": "@seanbaugh3239",
    "text": "🐕💨💩",
    "publishedAt": "2024-02-22T04:57:05Z"
  },
  {
    "author": "@lifeneedsmorechill",
    "text": "No woke boss babe nonsense?",
    "publishedAt": "2024-02-22T04:53:45Z"
  },
  {
    "author": "@cmont5636",
    "text": "But Dune, part two from the 80s has sting as the bad guy. how was Elvis? I should see the movie soon and yes I saw Dune one.",
    "publishedAt": "2024-02-22T04:52:36Z"
  },
  {
    "author": "@kirkdarling4120",
    "text": "Jeremy, you know this was just part two of a trilogy, right?",
    "publishedAt": "2024-02-22T04:52:13Z"
  },
  {
    "author": "@SsufferinSsuccotash",
    "text": "Really hoping my local imax will show a double bill.",
    "publishedAt": "2024-02-22T04:50:25Z"
  },
  {
    "author": "@donna25871",
    "text": "Isn’t Anna Taylor-Joy in it?",
    "publishedAt": "2024-02-22T04:49:30Z"
  },
  {
    "author": "@capsjukebox",
    "text": "Please Mr. Villenueve, give us the 3 hour English language Solaris adaptation for which we have been waiting",
    "publishedAt": "2024-02-22T04:49:14Z"
  },
  {
    "author": "@thomaszanzal7846",
    "text": "One thing about Christopher Walkin is that he has outlived them all and is still going strong. That guy has been at it (acting) without let up since the beginning of time.",
    "publishedAt": "2024-02-22T04:41:50Z"
  },
  {
    "author": "@apope06",
    "text": "I'm not a huge fan of Austin Butler. We will see",
    "publishedAt": "2024-02-22T04:33:58Z"
  },
  {
    "author": "@ciaranobrien8709",
    "text": "Read alot of Patterson and Stephen king novels and loved Tolkiens books growing up so seeing those on the big screen was mostly great. This is the first time I might pick up the books because I really liked the movie. Looking forward to seeing part 2. If Jeremy is this happy it can't be a bad night out ❤",
    "publishedAt": "2024-02-22T04:33:13Z"
  },
  {
    "author": "@TitaniumSeraph",
    "text": "\"Surprising religious tones\"....um, yeah. That's Dune. haha Glad Part 2 is just as good as Part 1!",
    "publishedAt": "2024-02-22T04:26:59Z"
  },
  {
    "author": "@eugenious05k40",
    "text": "Wait, did you actually not give a rating?",
    "publishedAt": "2024-02-22T04:26:36Z"
  },
  {
    "author": "@MrGlenbw",
    "text": "Jeremy's 'F**K YEAH!' pose in the thumbnail is more than enough to tell me that Dune Part Two will gonna kick ass in cinemas. \n\nF**K YEAH!!!! 🤜",
    "publishedAt": "2024-02-22T04:24:17Z"
  },
  {
    "author": "@theordofett",
    "text": "I can’t wait to watch it",
    "publishedAt": "2024-02-22T04:23:46Z"
  },
  {
    "author": "@budthecyborg4575",
    "text": "Can't wait to see the full story.",
    "publishedAt": "2024-02-22T04:19:54Z"
  },
  {
    "author": "@hayward5337",
    "text": "I think this same grace should have been given to Rebel Moon",
    "publishedAt": "2024-02-22T04:16:24Z"
  },
  {
    "author": "@NotaSandwich",
    "text": "No negatives. Gives it an eight",
    "publishedAt": "2024-02-22T04:15:45Z"
  },
  {
    "author": "@RyanLBrown9396",
    "text": "If Dune 2 comes out, kills it at the box office AND is genuinely good we gotta put Denis Villeneuve in the GOAT director conversation. It’s passed time",
    "publishedAt": "2024-02-22T04:15:11Z"
  },
  {
    "author": "@Tony-hv8wz",
    "text": "I waited to see the first dune until part 2 came out",
    "publishedAt": "2024-02-22T04:13:34Z"
  },
  {
    "author": "@dave52g",
    "text": "Jeremy Predestination review pls...",
    "publishedAt": "2024-02-22T04:09:39Z"
  },
  {
    "author": "@spencereades",
    "text": "The tough thing about Dune is you can't do anything halfway. You either trim it down to a 20-minute mood piece, or you balloon it out to an 8 hour marathon and just warn the audience they're gonna need Preparation H.",
    "publishedAt": "2024-02-22T04:08:30Z"
  },
  {
    "author": "@EthalaRide",
    "text": "but Jeremy, we gotta know\n_Did you buy the popcorn bucket._",
    "publishedAt": "2024-02-22T04:07:12Z"
  },
  {
    "author": "@SonyCamry",
    "text": "Hope its not as bpring as patt 1",
    "publishedAt": "2024-02-22T04:05:28Z"
  },
  {
    "author": "@zzzzzz69",
    "text": "Your intro is Iron Man riff?",
    "publishedAt": "2024-02-22T04:05:14Z"
  },
  {
    "author": "@BRETTFAVREISAVIKING",
    "text": "Bro it’s Feyd, not Thade😂",
    "publishedAt": "2024-02-22T04:03:28Z"
  },
  {
    "author": "@tempest_sigma",
    "text": "Spoilers right off the bat",
    "publishedAt": "2024-02-22T03:59:33Z"
  },
  {
    "author": "@teresa-wants-you",
    "text": "Robot lady and Wonka fall in love.”\r\n-Actual quote from Josh Brolin about Dune 2",
    "publishedAt": "2024-02-22T03:59:11Z"
  },
  {
    "author": "@chrishayes4166",
    "text": "283k vs 189k views up for Jahns after the first day. Jeremy crushes it because he's authentic and doesn't get caught up in the tribalism or any other non-\"is it good or not\" foolishness. A critic who is....a critic! Is it Awesometacular or is it Dogshit. Or somewhere in between? And when the biggest change in your ratings is going from \"Buy it on BluRay\" to \"Buy it on 4k\" lol.",
    "publishedAt": "2024-02-22T03:56:07Z"
  },
  {
    "author": "@schwangtv7448",
    "text": "is it just me or did he not put his rating at the end?  was it awesometacular? was it buy on blue ray?",
    "publishedAt": "2024-02-22T03:55:55Z"
  },
  {
    "author": "@BrimsHL",
    "text": "Well the first Dune movie was exactly like the miniseries that came out in 2000. And the mini-series was a big budget series. It was like 20 million with today's economy it would be 40 million. So the first one was nothing to me cuz I had already seen the mini series. And the doom miniseries was highly rated. Has everybody lost their minds and gone stupid.",
    "publishedAt": "2024-02-22T03:48:52Z"
  },
  {
    "author": "@Lanceawright",
    "text": "Before you were around, they did a Dune in the 1980s... I was in the theater opening night, and they were handing out pamphlets explaining things about the movie's story BEFORE we were to watch the movie.\n\nIf you need to add Cliff's Notes BEFORE you tell the story via the cinematic medium, you have failed as a story teller.\n\nThis one does much better.",
    "publishedAt": "2024-02-22T03:46:59Z"
  },
  {
    "author": "@theivanpe",
    "text": "That was a pretty good Walken…",
    "publishedAt": "2024-02-22T03:35:13Z"
  },
  {
    "author": "@gilpinsteven",
    "text": "Just resubscribed because you weren't getting all Jim Carrey on me",
    "publishedAt": "2024-02-22T03:34:53Z"
  },
  {
    "author": "@stoveguy2133",
    "text": "Zendaya is a skinny model.",
    "publishedAt": "2024-02-22T03:34:37Z"
  },
  {
    "author": "@johnkerr6265",
    "text": "What is this DOONE he keeps talking about?",
    "publishedAt": "2024-02-22T03:33:44Z"
  },
  {
    "author": "@mrpotato8297",
    "text": "So cinematographer decide how the shoot suppose to look like? Always thought that’s the director Job. Interesting",
    "publishedAt": "2024-02-22T03:33:03Z"
  },
  {
    "author": "@toddmeadows8179",
    "text": "I NEED you to know where it goes grom here.  Hope ya read y, but if not, ai hope they film at least till God Emperor of Dune",
    "publishedAt": "2024-02-22T03:31:24Z"
  },
  {
    "author": "@unit1pirate380",
    "text": "*im calling it now, jeremy doesnt wanna overhype dune but in his spoilertalk review, he'll say that dune pt 2 is actually:\n\n\n\n\n\n\n\n\n\n\n awesometacular",
    "publishedAt": "2024-02-22T03:29:33Z"
  },
  {
    "author": "@unit1pirate380",
    "text": "highly recommend people to watch lawrence of arabia after dune... was told to watch LoA when i said that Dune Part I was my all time fave film... LoA broke cinema for me for showing me what a perfect film is",
    "publishedAt": "2024-02-22T03:25:52Z"
  },
  {
    "author": "@MENTOKz",
    "text": "the miniseries dune and children of dune where the best. No movie I think will get that much detail and attention.",
    "publishedAt": "2024-02-22T03:25:44Z"
  },
  {
    "author": "@Pengalen",
    "text": "Having watched Dune Part 1, though the cinematography is sometimes nice in a very retro-futuristic way, like it would be cool in a series of stills in a coffee-table book, the whole movie is kind of dry and bland compared to the one from the 80's, which was stylish and vigorous by comparison. Also Chalomet is kind of annoying compared to Kyle MachLachlan.\nVaguely related, Edna Mode has to be based off of Linda Hunt, who played Shadout Mapes, and omg, I didn't know that Siân Phillips was also Cassiopeia in Clash of the Titans, but it makes perfect sense now.",
    "publishedAt": "2024-02-22T03:22:39Z"
  },
  {
    "author": "@greg.peepeeface",
    "text": "Not a shocker, but I had zero screen time, but my name is Greg...... just not Frazier",
    "publishedAt": "2024-02-22T03:20:06Z"
  },
  {
    "author": "@Taycore9",
    "text": "This is my most anticipated movie in years. I cant wait for Dune 2!",
    "publishedAt": "2024-02-22T03:18:29Z"
  },
  {
    "author": "@indrachaudhari7874",
    "text": "Anyone here remember playin Dune 2001 game?",
    "publishedAt": "2024-02-22T03:12:36Z"
  },
  {
    "author": "@EyeToob",
    "text": "\"Har - KO - Nen\"",
    "publishedAt": "2024-02-22T03:08:54Z"
  },
  {
    "author": "@blipmachine",
    "text": "Dune part 1 was fine but it’s no Secret Invasion. I hope part 2 rises up to that level of action and suspense.",
    "publishedAt": "2024-02-22T03:05:28Z"
  },
  {
    "author": "@Jhayzer021",
    "text": "Its time to go back in Arrakis!. 👊",
    "publishedAt": "2024-02-22T03:01:57Z"
  }
]
