[
  {
    "author": "@ap0110",
    "text": "the title of the sequel should be Duly. badum tss",
    "publishedAt": "2024-02-22T09:29:18Z"
  },
  {
    "author": "@chipwilliams5854",
    "text": "Dune is highly overrated, and the world building is uhhhhh.... lame? And nonsensical? Maybe i missed the point of the books, but, ehhhh....mehhh... its... certainly people on a sand planet... don't understand why there was a need for 3 books, a decent 80's adaptation, and then further, a re-re-remake.\n\nZendaya COLEMAN, yes she has a past name, she is, fine... in this film. Timothy shimbabbaramadom or whatever his name is, he's okay i guess. Jeremy suckin the peen a little too much on this one",
    "publishedAt": "2024-02-22T09:21:03Z"
  },
  {
    "author": "@JohnDoe-wq5eu",
    "text": "What's going to be probably one of the best movies of 2024 is weird to say considering it should have been the best movie of 2023. I hope there's more surprises this year but I'm not too sure what with the events of last year.",
    "publishedAt": "2024-02-22T09:12:13Z"
  },
  {
    "author": "@taydestiny38",
    "text": "Thank You Sir! Honest and forthcoming review with no B.S. attached to appease the masses.",
    "publishedAt": "2024-02-22T09:09:57Z"
  },
  {
    "author": "@louisblackforester",
    "text": "D- for costumes and set-design !",
    "publishedAt": "2024-02-22T09:02:24Z"
  },
  {
    "author": "@mad2403",
    "text": "well of course it has a religious tone cause it is heavily based on Islam",
    "publishedAt": "2024-02-22T09:01:35Z"
  },
  {
    "author": "@BigSteelThrill",
    "text": "this sucks, too much \"look at me\"",
    "publishedAt": "2024-02-22T08:53:25Z"
  },
  {
    "author": "@Dont-Ask-Me-My-Name",
    "text": "I loved the OG film from 1984 but I haven't seen Dune Part 1 yet.  I was waiting for Dune Part 2 to come out &I am absolutely going to watch Part 1 &then hit the I-Max for Part 2.  After Kill Bill vol 2 I told myself never again am I doing this Part 1 and then Part 2 not when it's the plan from the beginning nope.  Glad everyone that I watch/listen to is saying that the film is great &I absolutely agree that Greig Fraser is the best cinematographer in the business.  In my mind he's fighting with the great Wally Pfister for best cinematographer of the last 40 years w/ Nolan's new guy the only other one that is even in the conversation",
    "publishedAt": "2024-02-22T08:53:06Z"
  },
  {
    "author": "@RSRtwothousand5",
    "text": "Love the murph watch Jeremy 👍",
    "publishedAt": "2024-02-22T08:51:36Z"
  },
  {
    "author": "@NoobCraftCasting",
    "text": "did like dune part 1 not gonna watch part 2\n2",
    "publishedAt": "2024-02-22T08:40:17Z"
  },
  {
    "author": "@rrppodcast3347",
    "text": "I will binge.",
    "publishedAt": "2024-02-22T08:32:28Z"
  },
  {
    "author": "@anasshahid224",
    "text": "Great review Jeremy, Dune 1 was a treat, loved the world building, visuals, cinematography, everything was a treat, excited for Dune Part 2 😊",
    "publishedAt": "2024-02-22T08:22:07Z"
  },
  {
    "author": "@kal-nor",
    "text": "I felt like this review was done without the reviewer knowing there’s a part 3. It’s just the impression I get but makes me wonder how part 2 finishes. I can’t wait to watch it and find out.",
    "publishedAt": "2024-02-22T08:21:46Z"
  },
  {
    "author": "@runkurgan",
    "text": "5:39 thank you",
    "publishedAt": "2024-02-22T08:16:46Z"
  },
  {
    "author": "@louisduarte8763",
    "text": "Something I don't get about DUNE's Spice (a.k.a. Space Meth): is it Sandworm poop?",
    "publishedAt": "2024-02-22T08:10:19Z"
  },
  {
    "author": "@RtB68",
    "text": "Ahh-RAH-kis   Please.   Not Ahh-RAK-kis.  😅",
    "publishedAt": "2024-02-22T08:07:42Z"
  },
  {
    "author": "@dybcreations",
    "text": "It’s crazy how all three versions are wildly different but they are all amazing in different ways! I think it’s a great example of how a source material can be interpreted differently but still can all be valid adaptations",
    "publishedAt": "2024-02-22T08:06:32Z"
  },
  {
    "author": "@dice268926",
    "text": "Appreciated",
    "publishedAt": "2024-02-22T08:03:39Z"
  },
  {
    "author": "@4kfrank276",
    "text": "It better be the end of the series. I didn't know it was a sequel in the first Dune until the opening title, and if this is a sequel to a trilogy I'm passing on it.",
    "publishedAt": "2024-02-22T07:55:37Z"
  },
  {
    "author": "@McGarva97",
    "text": "What about the beast rabban did he get much screen time ?",
    "publishedAt": "2024-02-22T07:54:04Z"
  },
  {
    "author": "@ccan_max5285",
    "text": "Seriously looking forward to seeing this",
    "publishedAt": "2024-02-22T07:47:46Z"
  },
  {
    "author": "@samuellee257",
    "text": "I really hope Denis Villeneuve is able to direct the rest of the Dune Universe, he is the only one who can properly adapt a great book to the big screen.",
    "publishedAt": "2024-02-22T07:43:53Z"
  },
  {
    "author": "@raywalsh9152",
    "text": "Okay, how about if you really enjoy sci-fi books and movies, but you never took the time to read Dune, and you are almost 60 years old, so you remember the first movie, and it was pretty good, you enjoyed it, but your entire existence doesn't revolve around whether the movie adaptation captured the novel perfectly. Should I watch it? I have held off on watching part 1 until part 2 came out. So I'm looking at around 8 hours of movie watching, with drink runs and bathroom breaks. Which is fine, but ... Anyway, just asking for a friend. I'm more of a Woody Allen kinda guy.",
    "publishedAt": "2024-02-22T07:40:44Z"
  },
  {
    "author": "@zachariusthethird6627",
    "text": "Bro you suck at movie reviews. Just give up. Also your impersonations are cringe x10000",
    "publishedAt": "2024-02-22T07:36:57Z"
  },
  {
    "author": "@ruirengan",
    "text": "Hi. Would love to hear your reaction to the new borderlands trailer",
    "publishedAt": "2024-02-22T07:23:55Z"
  },
  {
    "author": "@TrupimOkiemTV",
    "text": "I loved Dune part 1. I saw it four times in cinema and enjoyed every moment of it.",
    "publishedAt": "2024-02-22T07:08:06Z"
  },
  {
    "author": "@chintanbankar5305",
    "text": "greg fraizer looks like he played reverse flash on the cw show",
    "publishedAt": "2024-02-22T07:05:48Z"
  },
  {
    "author": "@raddishtt",
    "text": "Greg Greg Greg",
    "publishedAt": "2024-02-22T07:04:38Z"
  },
  {
    "author": "@IanM-id8or",
    "text": "I hope they get as far as making a movie of God Emperor.  That's the book that the series is all about",
    "publishedAt": "2024-02-22T07:01:24Z"
  },
  {
    "author": "@Zarrus",
    "text": "Can't wait to see it!!!",
    "publishedAt": "2024-02-22T06:55:00Z"
  },
  {
    "author": "@darrenanderson2031",
    "text": "Can’t tell if he just called them the Ha-Conan’s satirically or what 😅",
    "publishedAt": "2024-02-22T06:43:50Z"
  },
  {
    "author": "@ShadowDzver",
    "text": "As a watch enthusiast myself, it`s great to see the Hamilton love yet again, given the watch brands history being entwined into cinema, it`s quite poetic sharing both passions. I`m sure we will enjoy part two.",
    "publishedAt": "2024-02-22T06:38:53Z"
  },
  {
    "author": "@SageRap",
    "text": "It feels like you're talking to someone over my left shoulder. Looking at yourself in the monitor the whole time, or a teleprompter I'm guessing?",
    "publishedAt": "2024-02-22T06:32:05Z"
  },
  {
    "author": "@KODIAK-ij4yg",
    "text": "The old Movie and Sci-fi Miniseries is all I need!!! Well I didn't like Part one and so I won't be watching Part two😂😂😂",
    "publishedAt": "2024-02-22T06:29:20Z"
  },
  {
    "author": "@lesath7883",
    "text": "I need to watch this.\nOn the cinema.",
    "publishedAt": "2024-02-22T06:25:57Z"
  },
  {
    "author": "@jonascastejon5888",
    "text": "Heretics Of Dune is my favorite Dune book 📚 and to me the best book in the series, followed closely by God Emperor.\n\nOne can only dream Denis bring those books to the big screen.",
    "publishedAt": "2024-02-22T06:22:38Z"
  },
  {
    "author": "@Cybertron-cs7sk",
    "text": "Jeremy and Drinker the modern Siskel and Ebert 2 thumbs up 👍 for my 2 favourite reviewers.",
    "publishedAt": "2024-02-22T06:16:58Z"
  },
  {
    "author": "@7dano523",
    "text": "Marvel should have waited for Denis to do Fantastic four....Also I would love him to do a Black Hole remake",
    "publishedAt": "2024-02-22T06:15:50Z"
  },
  {
    "author": "@antoniovelcovici9131",
    "text": "Imagine if he directed the star wars sequel trilogy",
    "publishedAt": "2024-02-22T06:15:13Z"
  },
  {
    "author": "@acpscreations1334",
    "text": "His expressions in the thumbnails of both movies seem like consecutive frames of the same excited emotion.",
    "publishedAt": "2024-02-22T06:15:06Z"
  },
  {
    "author": "@RVR121",
    "text": "Actual story telling? in modern hollywood sci fi...you'd almost say this is a prank call.",
    "publishedAt": "2024-02-22T06:08:05Z"
  },
  {
    "author": "@wellsaidgoodheadfred9843",
    "text": "are you going to do drive-away dolls?",
    "publishedAt": "2024-02-22T05:54:39Z"
  },
  {
    "author": "@patrickday4206",
    "text": "I can't wait for the extended editions like lotr 15 hours of movie 😂",
    "publishedAt": "2024-02-22T05:51:40Z"
  },
  {
    "author": "@patrickday4206",
    "text": "Nice walken impression 😊",
    "publishedAt": "2024-02-22T05:50:22Z"
  },
  {
    "author": "@yayap5631",
    "text": "Yooo is it possible for you to review the Japanese movie Character? Not sure if you did it or not.",
    "publishedAt": "2024-02-22T05:49:47Z"
  },
  {
    "author": "@connoriquada5429",
    "text": "Bro I forgot this movie even existed. I haven’t seen any advertisements for it whatsoever. I didn’t realize it was already out. Or coming out so soon. Or whatever 😂",
    "publishedAt": "2024-02-22T05:44:15Z"
  },
  {
    "author": "@HindiRapGuru",
    "text": "Dune is the most BORING sci-fi film I have ever seen in my life!",
    "publishedAt": "2024-02-22T05:30:56Z"
  },
  {
    "author": "@giovanniamador239",
    "text": "I wasn't impressed with doing part 1 , so I don't know if I should go and watch them part 2",
    "publishedAt": "2024-02-22T05:29:45Z"
  },
  {
    "author": "@gsurveil1",
    "text": "David Lynch?",
    "publishedAt": "2024-02-22T05:20:38Z"
  },
  {
    "author": "@darthscipio5289",
    "text": "I'm getting the feeling the Cinematography will be a ripoff of the Cinematography from LAWRENCE OF ARABIA as the book Dune is also a ripoff of Lawrence of Arabia",
    "publishedAt": "2024-02-22T05:15:48Z"
  },
  {
    "author": "@user-hc9ly8fl1r",
    "text": "Did the movie end where the book did or will there be a part 3?",
    "publishedAt": "2024-02-22T05:10:24Z"
  },
  {
    "author": "@killingtimeslowly1",
    "text": "Extremely jealous you got to see this masterpiece early. 😭😭😭😭😭",
    "publishedAt": "2024-02-22T05:04:20Z"
  },
  {
    "author": "@HoutrXuero",
    "text": "Ah my most trusted source, the villain from Madame Web",
    "publishedAt": "2024-02-22T04:57:19Z"
  },
  {
    "author": "@seanbaugh3239",
    "text": "🐕💨💩",
    "publishedAt": "2024-02-22T04:57:05Z"
  },
  {
    "author": "@lifeneedsmorechill",
    "text": "No woke boss babe nonsense?",
    "publishedAt": "2024-02-22T04:53:45Z"
  },
  {
    "author": "@cmont5636",
    "text": "But Dune, part two from the 80s has sting as the bad guy. how was Elvis? I should see the movie soon and yes I saw Dune one.",
    "publishedAt": "2024-02-22T04:52:36Z"
  },
  {
    "author": "@kirkdarling4120",
    "text": "Jeremy, you know this was just part two of a trilogy, right?",
    "publishedAt": "2024-02-22T04:52:13Z"
  },
  {
    "author": "@SsufferinSsuccotash",
    "text": "Really hoping my local imax will show a double bill.",
    "publishedAt": "2024-02-22T04:50:25Z"
  },
  {
    "author": "@donna25871",
    "text": "Isn’t Anna Taylor-Joy in it?",
    "publishedAt": "2024-02-22T04:49:30Z"
  },
  {
    "author": "@capsjukebox",
    "text": "Please Mr. Villenueve, give us the 3 hour English language Solaris adaptation for which we have been waiting",
    "publishedAt": "2024-02-22T04:49:14Z"
  },
  {
    "author": "@thomaszanzal7846",
    "text": "One thing about Christopher Walkin is that he has outlived them all and is still going strong. That guy has been at it (acting) without let up since the beginning of time.",
    "publishedAt": "2024-02-22T04:41:50Z"
  },
  {
    "author": "@apope06",
    "text": "I'm not a huge fan of Austin Butler. We will see",
    "publishedAt": "2024-02-22T04:33:58Z"
  },
  {
    "author": "@ciaranobrien8709",
    "text": "Read alot of Patterson and Stephen king novels and loved Tolkiens books growing up so seeing those on the big screen was mostly great. This is the first time I might pick up the books because I really liked the movie. Looking forward to seeing part 2. If Jeremy is this happy it can't be a bad night out ❤",
    "publishedAt": "2024-02-22T04:33:13Z"
  },
  {
    "author": "@TitaniumSeraph",
    "text": "\"Surprising religious tones\"....um, yeah. That's Dune. haha Glad Part 2 is just as good as Part 1!",
    "publishedAt": "2024-02-22T04:26:59Z"
  },
  {
    "author": "@eugenious05k40",
    "text": "Wait, did you actually not give a rating?",
    "publishedAt": "2024-02-22T04:26:36Z"
  },
  {
    "author": "@MrGlenbw",
    "text": "Jeremy's 'F**K YEAH!' pose in the thumbnail is more than enough to tell me that Dune Part Two will gonna kick ass in cinemas. \n\nF**K YEAH!!!! 🤜",
    "publishedAt": "2024-02-22T04:24:17Z"
  },
  {
    "author": "@theordofett",
    "text": "I can’t wait to watch it",
    "publishedAt": "2024-02-22T04:23:46Z"
  },
  {
    "author": "@budthecyborg4575",
    "text": "Can't wait to see the full story.",
    "publishedAt": "2024-02-22T04:19:54Z"
  },
  {
    "author": "@hayward5337",
    "text": "I think this same grace should have been given to Rebel Moon",
    "publishedAt": "2024-02-22T04:16:24Z"
  },
  {
    "author": "@NotaSandwich",
    "text": "No negatives. Gives it an eight",
    "publishedAt": "2024-02-22T04:15:45Z"
  },
  {
    "author": "@RyanLBrown9396",
    "text": "If Dune 2 comes out, kills it at the box office AND is genuinely good we gotta put Denis Villeneuve in the GOAT director conversation. It’s passed time",
    "publishedAt": "2024-02-22T04:15:11Z"
  },
  {
    "author": "@Tony-hv8wz",
    "text": "I waited to see the first dune until part 2 came out",
    "publishedAt": "2024-02-22T04:13:34Z"
  },
  {
    "author": "@dave52g",
    "text": "Jeremy Predestination review pls...",
    "publishedAt": "2024-02-22T04:09:39Z"
  },
  {
    "author": "@spencereades",
    "text": "The tough thing about Dune is you can't do anything halfway. You either trim it down to a 20-minute mood piece, or you balloon it out to an 8 hour marathon and just warn the audience they're gonna need Preparation H.",
    "publishedAt": "2024-02-22T04:08:30Z"
  },
  {
    "author": "@EthalaRide",
    "text": "but Jeremy, we gotta know\n_Did you buy the popcorn bucket._",
    "publishedAt": "2024-02-22T04:07:12Z"
  },
  {
    "author": "@SonyCamry",
    "text": "Hope its not as bpring as patt 1",
    "publishedAt": "2024-02-22T04:05:28Z"
  },
  {
    "author": "@zzzzzz69",
    "text": "Your intro is Iron Man riff?",
    "publishedAt": "2024-02-22T04:05:14Z"
  },
  {
    "author": "@BRETTFAVREISAVIKING",
    "text": "Bro it’s Feyd, not Thade😂",
    "publishedAt": "2024-02-22T04:03:28Z"
  },
  {
    "author": "@tempest_sigma",
    "text": "Spoilers right off the bat",
    "publishedAt": "2024-02-22T03:59:33Z"
  },
  {
    "author": "@teresa-wants-you",
    "text": "Robot lady and Wonka fall in love.”\r\n-Actual quote from Josh Brolin about Dune 2",
    "publishedAt": "2024-02-22T03:59:11Z"
  },
  {
    "author": "@chrishayes4166",
    "text": "283k vs 189k views up for Jahns after the first day. Jeremy crushes it because he's authentic and doesn't get caught up in the tribalism or any other non-\"is it good or not\" foolishness. A critic who is....a critic! Is it Awesometacular or is it Dogshit. Or somewhere in between? And when the biggest change in your ratings is going from \"Buy it on BluRay\" to \"Buy it on 4k\" lol.",
    "publishedAt": "2024-02-22T03:56:07Z"
  },
  {
    "author": "@schwangtv7448",
    "text": "is it just me or did he not put his rating at the end?  was it awesometacular? was it buy on blue ray?",
    "publishedAt": "2024-02-22T03:55:55Z"
  },
  {
    "author": "@BrimsHL",
    "text": "Well the first Dune movie was exactly like the miniseries that came out in 2000. And the mini-series was a big budget series. It was like 20 million with today's economy it would be 40 million. So the first one was nothing to me cuz I had already seen the mini series. And the doom miniseries was highly rated. Has everybody lost their minds and gone stupid.",
    "publishedAt": "2024-02-22T03:48:52Z"
  },
  {
    "author": "@Lanceawright",
    "text": "Before you were around, they did a Dune in the 1980s... I was in the theater opening night, and they were handing out pamphlets explaining things about the movie's story BEFORE we were to watch the movie.\n\nIf you need to add Cliff's Notes BEFORE you tell the story via the cinematic medium, you have failed as a story teller.\n\nThis one does much better.",
    "publishedAt": "2024-02-22T03:46:59Z"
  },
  {
    "author": "@theivanpe",
    "text": "That was a pretty good Walken…",
    "publishedAt": "2024-02-22T03:35:13Z"
  },
  {
    "author": "@gilpinsteven",
    "text": "Just resubscribed because you weren't getting all Jim Carrey on me",
    "publishedAt": "2024-02-22T03:34:53Z"
  },
  {
    "author": "@stoveguy2133",
    "text": "Zendaya is a skinny model.",
    "publishedAt": "2024-02-22T03:34:37Z"
  },
  {
    "author": "@johnkerr6265",
    "text": "What is this DOONE he keeps talking about?",
    "publishedAt": "2024-02-22T03:33:44Z"
  },
  {
    "author": "@mrpotato8297",
    "text": "So cinematographer decide how the shoot suppose to look like? Always thought that’s the director Job. Interesting",
    "publishedAt": "2024-02-22T03:33:03Z"
  },
  {
    "author": "@toddmeadows8179",
    "text": "I NEED you to know where it goes grom here.  Hope ya read y, but if not, ai hope they film at least till God Emperor of Dune",
    "publishedAt": "2024-02-22T03:31:24Z"
  },
  {
    "author": "@unit1pirate380",
    "text": "*im calling it now, jeremy doesnt wanna overhype dune but in his spoilertalk review, he'll say that dune pt 2 is actually:\n\n\n\n\n\n\n\n\n\n\n awesometacular",
    "publishedAt": "2024-02-22T03:29:33Z"
  },
  {
    "author": "@unit1pirate380",
    "text": "highly recommend people to watch lawrence of arabia after dune... was told to watch LoA when i said that Dune Part I was my all time fave film... LoA broke cinema for me for showing me what a perfect film is",
    "publishedAt": "2024-02-22T03:25:52Z"
  },
  {
    "author": "@MENTOKz",
    "text": "the miniseries dune and children of dune where the best. No movie I think will get that much detail and attention.",
    "publishedAt": "2024-02-22T03:25:44Z"
  },
  {
    "author": "@Pengalen",
    "text": "Having watched Dune Part 1, though the cinematography is sometimes nice in a very retro-futuristic way, like it would be cool in a series of stills in a coffee-table book, the whole movie is kind of dry and bland compared to the one from the 80's, which was stylish and vigorous by comparison. Also Chalomet is kind of annoying compared to Kyle MachLachlan.\nVaguely related, Edna Mode has to be based off of Linda Hunt, who played Shadout Mapes, and omg, I didn't know that Siân Phillips was also Cassiopeia in Clash of the Titans, but it makes perfect sense now.",
    "publishedAt": "2024-02-22T03:22:39Z"
  },
  {
    "author": "@greg.peepeeface",
    "text": "Not a shocker, but I had zero screen time, but my name is Greg...... just not Frazier",
    "publishedAt": "2024-02-22T03:20:06Z"
  },
  {
    "author": "@Taycore9",
    "text": "This is my most anticipated movie in years. I cant wait for Dune 2!",
    "publishedAt": "2024-02-22T03:18:29Z"
  },
  {
    "author": "@indrachaudhari7874",
    "text": "Anyone here remember playin Dune 2001 game?",
    "publishedAt": "2024-02-22T03:12:36Z"
  },
  {
    "author": "@EyeToob",
    "text": "\"Har - KO - Nen\"",
    "publishedAt": "2024-02-22T03:08:54Z"
  },
  {
    "author": "@blipmachine",
    "text": "Dune part 1 was fine but it’s no Secret Invasion. I hope part 2 rises up to that level of action and suspense.",
    "publishedAt": "2024-02-22T03:05:28Z"
  },
  {
    "author": "@Jhayzer021",
    "text": "Its time to go back in Arrakis!. 👊",
    "publishedAt": "2024-02-22T03:01:57Z"
  },
  {
    "author": "@WhyteLis21",
    "text": "Wait, Jeremy? Hollywood is afraid of young love stories? Well, I'll have you know some of my family members and relatives are young lovers til this day. From high school sweet hearts and on ward. Lol.",
    "publishedAt": "2024-02-22T03:00:48Z"
  },
  {
    "author": "@chad6738",
    "text": "When you watch a movie review hoping you don't hear a spoiler, then you remember you read the books.",
    "publishedAt": "2024-02-22T02:54:33Z"
  },
  {
    "author": "@EAGLEEYECOMICS",
    "text": "Is Alia in it or are they going to save it for the dune messiah movie?",
    "publishedAt": "2024-02-22T02:48:43Z"
  },
  {
    "author": "@Aaron-cc7yq",
    "text": "I just watched Dune part 1 for the 1st time last week. After seeing Godzilla Minus One in theaters, I am now back on board the train of needing to see certain movies in theaters. Dune part 2 will be one of those!",
    "publishedAt": "2024-02-22T02:47:22Z"
  },
  {
    "author": "@khoanguyen-jx4ii",
    "text": "your walken is on point",
    "publishedAt": "2024-02-22T02:46:50Z"
  },
  {
    "author": "@MrMackievelli",
    "text": "Religion was a big part of the books. Second I would say to ecology. If they include more of the BG machinations and how they seeded the 'prophecy' of the Lisan al Gaib across the universe and the Fremen so when the time came they would control the masses with their Messiah, Mahdi, and take control of the universe.",
    "publishedAt": "2024-02-22T02:46:43Z"
  },
  {
    "author": "@hahajenkins",
    "text": "Aren’t they doing a 3? Or does the story end perfectly?",
    "publishedAt": "2024-02-22T02:41:11Z"
  },
  {
    "author": "@GalaxyOfBoltz",
    "text": "Your reviews > Stuckman",
    "publishedAt": "2024-02-22T02:40:12Z"
  },
  {
    "author": "@bradleybuyer5541",
    "text": "80s director cut will always be my favorite.  So over the top characters really made the story come alive.  Kyle MacLachlan's \"SILENCE!!!\" will never be matched.",
    "publishedAt": "2024-02-22T02:37:40Z"
  },
  {
    "author": "@Nexus2Eden",
    "text": "I love you for still saying HarConenan! I will always call them that - harkanon sounds stupid. Even reading the novel it was always Har-konnen. 😊",
    "publishedAt": "2024-02-22T02:35:34Z"
  },
  {
    "author": "@umacalopsitaeumviolao",
    "text": "Really looking forward to watching RavierBarden's performance. He was superb in The Little Mermaid.",
    "publishedAt": "2024-02-22T02:33:24Z"
  },
  {
    "author": "@RebelPlanet1",
    "text": "So the same thing you complained about in Rebel Moon you forgave here. Alright",
    "publishedAt": "2024-02-22T02:30:42Z"
  },
  {
    "author": "@fingaz1993",
    "text": "I'm a fan. But, y'all ever notice Jeremy doesn't review black movies like that?",
    "publishedAt": "2024-02-22T02:28:22Z"
  },
  {
    "author": "@TheTwoFishes",
    "text": "Well, Dune 1984, I loved Sean Young as Chani, Virginia Madsen as Princess Irulan, Kyle Maclachlan as Paul Atreides, but the best part is the end of the movie when Paul makes it rain on Arrakis, and his little sister Alia says, \"and how can this be, for he is the Kwisatz Haderach\". What an amazing scene that is. I have not seen the new Dune Part 2, but I can only hope they have a scene such as this in the new movie.",
    "publishedAt": "2024-02-22T02:26:47Z"
  },
  {
    "author": "@chrisvielle6629",
    "text": "Is the dialog still sound Fakish. NO one talks like any of these boring people.",
    "publishedAt": "2024-02-22T02:25:12Z"
  },
  {
    "author": "@whatsinthebox9732",
    "text": "I really hope Villeneuve will have a directors cut of both films to create one super 6-7 hour film🤞",
    "publishedAt": "2024-02-22T02:24:23Z"
  },
  {
    "author": "@Suzanne_sf",
    "text": "I like the Sci Fi Dune series the best so far. Of course, I have not seen the director's cut of David Lynch's Dune & I have not seen Dune Part 2 yet. I do however, like Dune Part 1 & I didn't expect to. I wasn't going to see it. My brother wanted to see it so we went. I was surprised that I liked it.",
    "publishedAt": "2024-02-22T02:23:11Z"
  },
  {
    "author": "@redbandfilms",
    "text": "Havent seen Jeremy this enthusiastic since his review of \"The Force Awakens.\" 8 years ago...literally draped in a childhood blanket espousing how Daisy Ridley and John Boyega have impressive futures ahead.....at the end of the day, Jeremy reviews movies. He's never presented himself as a prophet....its just his opinions as a fan of cinema. With that said, think for yourself. I'm sure the last thing JJ wants is to think for you.",
    "publishedAt": "2024-02-22T02:17:16Z"
  },
  {
    "author": "@jaerondungca2909",
    "text": "DUNE PART TWO IS THE BIGGEST EPIC CINEMATIC FLICK EVER",
    "publishedAt": "2024-02-22T02:14:46Z"
  },
  {
    "author": "@matthewkeating-od6rl",
    "text": "I liked the tv version and its sequel the children of dune.",
    "publishedAt": "2024-02-22T02:13:42Z"
  },
  {
    "author": "@RiZenAsH",
    "text": "I loved all the Dune movies and mini series. Granted in the mini series there are scenes where you can tell it’s on a stage but still excellent.",
    "publishedAt": "2024-02-22T02:12:24Z"
  },
  {
    "author": "@locksand45",
    "text": "Omg, just accept Donald Trump into your heart as your personal lord and savior.  His foot is in the door.  He's asking for the sale.  Just sign.  You know you want to.  Accept Trump as your living God by liking this comment.  He will do the rest.",
    "publishedAt": "2024-02-22T02:10:25Z"
  },
  {
    "author": "@SuperDG333",
    "text": "Hope Tom Holland starts getting him some romance roles too",
    "publishedAt": "2024-02-22T02:08:12Z"
  },
  {
    "author": "@mechajay3358",
    "text": "Sounds like Dune 2 is going to ve a visual spectacle. Can't wait.",
    "publishedAt": "2024-02-22T02:05:43Z"
  },
  {
    "author": "@flixfixonyt",
    "text": "Were almost DUNE waiting for the movie!",
    "publishedAt": "2024-02-22T02:04:37Z"
  },
  {
    "author": "@mateofantasma",
    "text": "So glad to hear this one was worth the wait! Super excited to go see it!",
    "publishedAt": "2024-02-22T02:02:37Z"
  },
  {
    "author": "@KelleyGondran",
    "text": "Dune is where Freddy Krueger would send Anakin if he was having a nightmare.",
    "publishedAt": "2024-02-22T02:01:31Z"
  },
  {
    "author": "@SantianoBe",
    "text": "This director made the most boring movie ever with Bladerunner. Haven't seen part 1 because people said it was equally as boring. Is this true?",
    "publishedAt": "2024-02-22T01:58:02Z"
  },
  {
    "author": "@pcb462",
    "text": "I really enjoyed part one, but I simply won’t watch part two. I don’t care for Austin Butler at all. Hopefully, before I die, and I will let us take actors out of movies that draw us out of the experience. But if not, this is the first world problem and I’m sure many people will enjoy it.",
    "publishedAt": "2024-02-22T01:54:01Z"
  },
  {
    "author": "@AlbertoRodriguez-zb3iu",
    "text": "Dune is a huge book to put into a feature film without it being 6+ hours, cutting scenes is a must.",
    "publishedAt": "2024-02-22T01:53:22Z"
  },
  {
    "author": "@AlbertoRodriguez-zb3iu",
    "text": "Dune is a huge book to put into a feature film without it being 6+ hours, cutting scenes is a must.",
    "publishedAt": "2024-02-22T01:53:21Z"
  },
  {
    "author": "@THE_CDN",
    "text": "Oh, Hollywood doesn't have a problem with love stories. It just has a problem with a certain, very common, type of love story. I'm really looking forward to seeing this in an Imax theatre! I'm also going to wait with baited breath for the, hopefully inevitable, super mega extended director's cut boxed set that includes a small amount of actual Spice.",
    "publishedAt": "2024-02-22T01:52:36Z"
  },
  {
    "author": "@Stitchman3875",
    "text": "I see you haven't read the books.  You'll be in for a shock for when they make Dune Messiah into a movie.  That is where the themes of the series come out.",
    "publishedAt": "2024-02-22T01:49:49Z"
  },
  {
    "author": "@SelwynSlamdill-he8yh",
    "text": "I cant believe zendaya is actually in a good movie..since we all hate her in spiderman please go home",
    "publishedAt": "2024-02-22T01:48:59Z"
  },
  {
    "author": "@skoolynugenator1802",
    "text": "Anybody that hates part 1, I have some serious questions.",
    "publishedAt": "2024-02-22T01:48:35Z"
  },
  {
    "author": "@dapap93",
    "text": "That impression earned a like",
    "publishedAt": "2024-02-22T01:45:02Z"
  },
  {
    "author": "@gorrow1990",
    "text": "I'm so hyped for this next Thursday.\n2024 has badly needed a great movie to arrive ASAP the way it's started out.\nAs much as I enjoy watching Jeremy roast bad movies, it's awesome to see him enthusiastic about a movie that is arriving in theaters soon.",
    "publishedAt": "2024-02-22T01:37:34Z"
  },
  {
    "author": "@leopaulek7720",
    "text": "I’m just sad that Denis killed Lady Jessica’s character, she’s super cool in the book.",
    "publishedAt": "2024-02-22T01:33:26Z"
  },
  {
    "author": "@odlanorirom",
    "text": "...am I the only one who's hoping that Duncan Idaho(Jason Momoa) is still alive in the sequel?",
    "publishedAt": "2024-02-22T01:30:55Z"
  },
  {
    "author": "@MCCrleone354",
    "text": "If I had to pick an official version of Dune which is my favorite: the Denis Villeneuve one will probably be it once I see pt 2.\n\nPersonally, I really like the Dune ‘84 “spice diver” fan edit",
    "publishedAt": "2024-02-22T01:29:54Z"
  },
  {
    "author": "@mutazila10",
    "text": "Why didn't they make a Trilogy?",
    "publishedAt": "2024-02-22T01:29:36Z"
  },
  {
    "author": "@BaneLoki",
    "text": "Bring out the extended cut🎉",
    "publishedAt": "2024-02-22T01:27:11Z"
  },
  {
    "author": "@necrotic256",
    "text": "I really liked Dune from 2000 with Alec Newman",
    "publishedAt": "2024-02-22T01:24:42Z"
  },
  {
    "author": "@marniekilbourne608",
    "text": "The movie doesn't come out until March 15th. How could we have seen it? Has it been released first in another country?",
    "publishedAt": "2024-02-22T01:21:51Z"
  },
  {
    "author": "@Smoustart",
    "text": "It’s too bad the lead actor is a Zionist",
    "publishedAt": "2024-02-22T01:19:06Z"
  },
  {
    "author": "@bhasty1",
    "text": "I was over it by the end of the first movie.",
    "publishedAt": "2024-02-22T01:17:45Z"
  },
  {
    "author": "@mrgoober6320",
    "text": "Chani doesn't have a lot to do in the novel.  I'm wondering if they just gave her other characters' scenes.",
    "publishedAt": "2024-02-22T01:16:01Z"
  },
  {
    "author": "@fredlusyk6741",
    "text": "...Pretty Good Walken!!!\n😄👍\n\n《Wonka: Folie à Deux'n...?》\n\n👽 🖖 🤖",
    "publishedAt": "2024-02-22T01:15:26Z"
  },
  {
    "author": "@do-ol2540",
    "text": "Isn’t Dune supposed to be a trilogy, if so then Who’s going to tell him?",
    "publishedAt": "2024-02-22T01:14:12Z"
  },
  {
    "author": "@georgebaker5063",
    "text": "The movie can diverge from the novels if it looks and feels as wonderful as it does - I'd rather have two epic experiences than one that plays a shadow of itself. Beautiful visual language of a masterpiece of literature",
    "publishedAt": "2024-02-22T01:13:36Z"
  },
  {
    "author": "@StewGamingTV",
    "text": "These movies are just a sad rehash. Almost scene for scene of the 1984 movie that is amazing.",
    "publishedAt": "2024-02-22T01:12:49Z"
  },
  {
    "author": "@jeysmoothies",
    "text": "The first movie dragged",
    "publishedAt": "2024-02-22T01:12:45Z"
  },
  {
    "author": "@DarkR8ven",
    "text": "I might be on an island but i have never been able to watch the original i fond it really boring (im not badhing it in any way) im just saying for myself it os very boring, nlw i have tried twice to watch part one of the remake and am having the same problem so i just dont think this world is for me",
    "publishedAt": "2024-02-22T01:11:54Z"
  },
  {
    "author": "@theterbear9915",
    "text": "I'd like to watch 1 and 2 back to back definitely. Jeremy you want to play a game that's sci-fi and deals with amazing religious tones, Xenogears.",
    "publishedAt": "2024-02-22T01:11:39Z"
  },
  {
    "author": "@CalebByRamen",
    "text": "So excited for this one!",
    "publishedAt": "2024-02-22T01:11:29Z"
  },
  {
    "author": "@SteezyRaw",
    "text": "How is there already reviews when the movies is even out for another 2 weeks that’s kind of wack",
    "publishedAt": "2024-02-22T01:08:46Z"
  },
  {
    "author": "@JnEricsonx",
    "text": "3:40-thanks for making me near choke on my drink Jeremy!",
    "publishedAt": "2024-02-22T01:03:57Z"
  },
  {
    "author": "@bluecollarmenproductions",
    "text": "Dune 1 was sooo boring and confusing it was equal to Tenet to me😊",
    "publishedAt": "2024-02-22T01:03:50Z"
  },
  {
    "author": "@ethanwarwick9898",
    "text": "He didn’t mention Florence Pugh once",
    "publishedAt": "2024-02-22T01:01:36Z"
  },
  {
    "author": "@genemak3233",
    "text": "Who is this Muad'Dib ... may I ask?😁 Well done!",
    "publishedAt": "2024-02-22T01:01:33Z"
  },
  {
    "author": "@RocketDanger1",
    "text": "Thanks man!❤😂🎉😊",
    "publishedAt": "2024-02-22T01:01:02Z"
  },
  {
    "author": "@rt1326",
    "text": "hell yea, looking forward to this. I purposefully waited to grab the 4K of part 1 because I figure they are going to release a nice \"full version\" copy. I was expecting this to be good, positive reviews have me more excited.",
    "publishedAt": "2024-02-22T00:59:46Z"
  },
  {
    "author": "@punishedf",
    "text": "gross love story",
    "publishedAt": "2024-02-22T00:59:09Z"
  },
  {
    "author": "@B.D.F.",
    "text": "0:55 Weird phobia of love stories? The Hollywood that turns far too many movies with any male character and any female character into a love story? I think I’m going to need more clarification on that statement.",
    "publishedAt": "2024-02-22T00:56:31Z"
  },
  {
    "author": "@lustbubo4638",
    "text": "I must be lame. Absolutely nothing seems interesting about this movie. The should be called Dull, not Dune. Dull colors, Dull story, Dull acting,",
    "publishedAt": "2024-02-22T00:43:54Z"
  },
  {
    "author": "@billybeefcake6543",
    "text": "Is it better than Dune part 1? You know, where the dude stands in the middle of the desert and stares off into the distance for 45 hours?",
    "publishedAt": "2024-02-22T00:43:51Z"
  },
  {
    "author": "@Vin-fu1rm",
    "text": "I remember watching part one with my senior teacher.",
    "publishedAt": "2024-02-22T00:43:11Z"
  },
  {
    "author": "@ivanmuniz9812",
    "text": "Haven’t seen part 2 yet but Sci-fi channel’s Children of Dune was better than part 1. Yup…\nAlso David Lynch's Dune can’t be beat. Patrick Stewart. Nuff said…",
    "publishedAt": "2024-02-22T00:42:47Z"
  },
  {
    "author": "@SheyD78",
    "text": "Hearing that religion gets more of an emphasis is cool, given that it was a big part of the books. I read them long after I saw the orginal movie and was caught by surprise by it.",
    "publishedAt": "2024-02-22T00:42:05Z"
  },
  {
    "author": "@miguelgrau864",
    "text": "har-conan the barbarian",
    "publishedAt": "2024-02-22T00:35:00Z"
  },
  {
    "author": "@miguelgrau864",
    "text": "the book is spectacular, these movies do it no justice",
    "publishedAt": "2024-02-22T00:34:11Z"
  },
  {
    "author": "@Designsecrets",
    "text": "I thought the first movie just dragged on.......just boring",
    "publishedAt": "2024-02-22T00:34:09Z"
  },
  {
    "author": "@johnrimmer599",
    "text": "I read the book in junior high and really enjoyed it. I'm 58 now. I haven't seen any of the Dune movies. The thing is I don't remember anything about the book. Should I reread the book before I watch the movie? Any advice?",
    "publishedAt": "2024-02-22T00:30:43Z"
  },
  {
    "author": "@13Doses",
    "text": "They need to cast Austin Butler as Freeza if they ever do another live DBZ movie.",
    "publishedAt": "2024-02-22T00:27:51Z"
  },
  {
    "author": "@npatil85",
    "text": "I like the 3hr dir cut of dune lunch version.\n\nI saw the original again on the big screen at amc few days ago",
    "publishedAt": "2024-02-22T00:25:45Z"
  },
  {
    "author": "@jwb2814",
    "text": "Power of editing…",
    "publishedAt": "2024-02-22T00:25:44Z"
  },
  {
    "author": "@NIL0S",
    "text": "Now, we want the extended 8 hour cut of the duology 😏",
    "publishedAt": "2024-02-22T00:20:32Z"
  },
  {
    "author": "@BoilingKoolaid",
    "text": "I loved the first movie enough to get the book on audible. I love both versions. After seeing what the second book would be about, I decided the first one was good by itself and stopped there.",
    "publishedAt": "2024-02-22T00:19:14Z"
  },
  {
    "author": "@StreetPreacherr",
    "text": "It'll suck enjoying part 1 in GLORIOUS 3D, and then getting screwed with 2Dfor the second half?!?!",
    "publishedAt": "2024-02-22T00:18:49Z"
  },
  {
    "author": "@TheBerylknight",
    "text": "I thought part 1 was boring.",
    "publishedAt": "2024-02-22T00:16:16Z"
  },
  {
    "author": "@Rkuuyam",
    "text": "Thanks 👻",
    "publishedAt": "2024-02-22T00:15:59Z"
  },
  {
    "author": "@robertdeskoski9783",
    "text": "Har-kohhhhhh-nen.\n\nYou're right, Jeremy: That's the only way to do that.",
    "publishedAt": "2024-02-22T00:13:39Z"
  },
  {
    "author": "@damunzy",
    "text": "Did you catch Dune (1984) in the theater? I recently enjoyed that.",
    "publishedAt": "2024-02-22T00:13:24Z"
  },
  {
    "author": "@threadpusher",
    "text": "At risk of sounding like a noob Is this going to be a trilogy?",
    "publishedAt": "2024-02-22T00:13:05Z"
  },
  {
    "author": "@horrormoviesmetoo",
    "text": "Great Dune 2 review, now where lisa Frankenstein review",
    "publishedAt": "2024-02-22T00:13:05Z"
  },
  {
    "author": "@Tman001100",
    "text": "🤣🤣 @ 3:40 I got caught off-guard again by another Jeremy impression in the best way lol 👍👍 I can't wait to see Part 2 and perhaps Part 3.",
    "publishedAt": "2024-02-22T00:12:20Z"
  },
  {
    "author": "@scottanderson5581",
    "text": "That Walken impression.....outstanding.",
    "publishedAt": "2024-02-22T00:10:52Z"
  },
  {
    "author": "@Edselsmellswell",
    "text": "Dune part 1 is such a comfort movie lol it reminds me of Sunday morning no work and just staying inside when it’s raining and chilly outside. I watch it from time to time ❤ can’t wait for part 2",
    "publishedAt": "2024-02-22T00:10:35Z"
  },
  {
    "author": "@YokieDoke",
    "text": "My question is whether they left it open for part 3?I had heard Denis wasn't shooting the Idea down but didn't want to go past 3.",
    "publishedAt": "2024-02-22T00:09:57Z"
  },
  {
    "author": "@timmholl9238",
    "text": "One of my favorite theater-going moments the past twenty years, was when \"The Hobbit (Part 1)\" was over --> the ENTIRE theater, people who you would look at and think they talk beer and football only, walked away, \"That's not in the book. That wasn't in the book! Why is a part one?\"\n\nMy people!",
    "publishedAt": "2024-02-22T00:07:07Z"
  },
  {
    "author": "@robertwhitephotography",
    "text": "Yep... gotta see this one !!",
    "publishedAt": "2024-02-22T00:06:29Z"
  },
  {
    "author": "@user-tm8sc2kz8f",
    "text": "Please stop bringing up the amount of time the movie is. Real fans do not care if it is 4 hours",
    "publishedAt": "2024-02-22T00:04:37Z"
  },
  {
    "author": "@WuhSuhDood",
    "text": "I need help. I didn't like the first Dune. I love sci-fi and everyone involved in the film is awesome, why couldn't I get in to the movie?",
    "publishedAt": "2024-02-22T00:04:20Z"
  },
  {
    "author": "@VaultBoiGeralt",
    "text": "Sensational Walken impression.",
    "publishedAt": "2024-02-22T00:04:05Z"
  },
  {
    "author": "@gawaniwhitecrow2731",
    "text": "Done - June - Doom- Dude - Dune - Tune was extremely well done in the   5th Quarter",
    "publishedAt": "2024-02-22T00:02:41Z"
  },
  {
    "author": "@Sylla402",
    "text": "I wish some of these reviewers were well-versed with the Dune books. They'd appreciate the movies more.",
    "publishedAt": "2024-02-22T00:00:57Z"
  },
  {
    "author": "@NarcissistAU",
    "text": "Lynch is life.",
    "publishedAt": "2024-02-22T00:00:22Z"
  },
  {
    "author": "@General_reader",
    "text": "0:46 “I was worried the first hour”. “The first hour was my favorite hour“",
    "publishedAt": "2024-02-21T23:58:20Z"
  },
  {
    "author": "@andrewekern3575",
    "text": "Ezekiel must have came back to life and went undercover, can’t fool us anymore.",
    "publishedAt": "2024-02-21T23:55:28Z"
  },
  {
    "author": "@Eldrad235",
    "text": "Is there a part 3?",
    "publishedAt": "2024-02-21T23:41:31Z"
  },
  {
    "author": "@MrAicex3000",
    "text": "This dune is for who? Definitely not dune fans. If you watched the original and you say you like this you are a liar.",
    "publishedAt": "2024-02-21T23:39:06Z"
  },
  {
    "author": "@FelipeKana1",
    "text": "I want to see Villeneuve do all the six books! Even the ones I didn't understand at all",
    "publishedAt": "2024-02-21T23:38:33Z"
  },
  {
    "author": "@frozunyogert6159",
    "text": "I love the Villenueve film, but the miniseries is def the most book accurate adaptation.",
    "publishedAt": "2024-02-21T23:38:28Z"
  },
  {
    "author": "@TrinoClips",
    "text": "Hi can you review the new demon slayer movie",
    "publishedAt": "2024-02-21T23:34:33Z"
  },
  {
    "author": "@florencioriverajr.4992",
    "text": "The music in these movies perfection",
    "publishedAt": "2024-02-21T23:31:42Z"
  },
  {
    "author": "@CD-bn7el",
    "text": "Christopher Walkin!",
    "publishedAt": "2024-02-21T23:31:40Z"
  },
  {
    "author": "@mattjackson",
    "text": "Walken impersonation was perfect!",
    "publishedAt": "2024-02-21T23:31:23Z"
  },
  {
    "author": "@ElijahMan2633",
    "text": "When do we get the Zone of Interest review?",
    "publishedAt": "2024-02-21T23:29:16Z"
  },
  {
    "author": "@Fokfeesspecial",
    "text": "I am only going to watch it in Cinema just for the score of Hans Zimmer! I've won 2 tickets this week so that's settled. Hope the movie is great!",
    "publishedAt": "2024-02-21T23:27:30Z"
  },
  {
    "author": "@andrepalatino3376",
    "text": "My favorite version of Dune is the Sci-fi channel one. It may still be the most viewed series they ever made. It might be the nostalgia for me but I just had to watch it every time it was on and I have since bought it and it is a very well worn dvd",
    "publishedAt": "2024-02-21T23:26:22Z"
  },
  {
    "author": "@PunxsutawneyDave",
    "text": "I'm going to see this movie but if I were even remotely on the fence, watching Jeremy have to force himself away from spoilers because the movie is just that deep, would instantly sell me.",
    "publishedAt": "2024-02-21T23:25:44Z"
  },
  {
    "author": "@romankotas448",
    "text": "Plans within plans",
    "publishedAt": "2024-02-21T23:25:00Z"
  },
  {
    "author": "@willard39",
    "text": "I love the books (even his son's...I know, I'm insane), just like I loved the LOTR books, and the movies did an amazing job adapting them. Same for the first installment - amazing adaptation. I'm not looking for a word for word adaptation. It just has to nail the essence of the story - mission accomplished so far, as I haven't see P2 yet. It would be very surprising to me, given how much I loved P1, that I wouldn't love this too. This is where all the incredible lead-up leads up to. Unless they completely re-write and fuck up the denouement or fire the FX guys and replaced them with apes, pretty hard to drop the Fremen here.",
    "publishedAt": "2024-02-21T23:21:50Z"
  },
  {
    "author": "@mjwbulich",
    "text": "Just an FYI, my girlfriend is Finnish and Harkonen is a real name. The new pronunciation is much closer.",
    "publishedAt": "2024-02-21T23:19:27Z"
  },
  {
    "author": "@henryw31",
    "text": "Dune part 1 was so boring ..",
    "publishedAt": "2024-02-21T23:18:04Z"
  },
  {
    "author": "@somejerkbag",
    "text": "Denis Villenuve please make a Star Wars sequal trilogy reboot next 😊\nOr the Dark Elf trilogy would be great",
    "publishedAt": "2024-02-21T23:17:53Z"
  },
  {
    "author": "@jawsh6044",
    "text": "Austin Butler blew your Walken out of the water. Sorry Jeremy",
    "publishedAt": "2024-02-21T23:16:00Z"
  },
  {
    "author": "@wiiplaya25",
    "text": "My biggest fear is taking Timmy seriously in any kind of menacing or powerful role.",
    "publishedAt": "2024-02-21T23:15:13Z"
  },
  {
    "author": "@MainerdLoyd",
    "text": "LOL Grace said you don't need to see part one.",
    "publishedAt": "2024-02-21T23:14:10Z"
  },
  {
    "author": "@Th3PROfessa1",
    "text": "For ARACHIS!!!",
    "publishedAt": "2024-02-21T23:12:53Z"
  },
  {
    "author": "@JD5DAD",
    "text": "The original 80's movie is unadulterated DOGSHIT",
    "publishedAt": "2024-02-21T23:12:28Z"
  },
  {
    "author": "@Deltores13",
    "text": "I'm surprised he didn't say awsometaclur!🤔",
    "publishedAt": "2024-02-21T23:07:31Z"
  },
  {
    "author": "@jennifirehere1413",
    "text": "Remind me not to have food in my mouth when you do \"The Walken.\" Let's just say, I had to pause to clean off my desk.",
    "publishedAt": "2024-02-21T23:06:47Z"
  },
  {
    "author": "@quentinmanson3287",
    "text": "The first movie was such a nothing burger. I kept waiting for the movie to happen.\nI will not be seeing this one.",
    "publishedAt": "2024-02-21T23:03:49Z"
  },
  {
    "author": "@angelarch5352",
    "text": "Miniseries Season 2 of Dune, Children of Dune, was my all time favorite!  The new Dune has better effects of course, but the story in the miniseries and characters were the best!",
    "publishedAt": "2024-02-21T23:02:33Z"
  },
  {
    "author": "@stevenesbitt3528",
    "text": "Can’t wait for this one, really enjoyed part one",
    "publishedAt": "2024-02-21T23:02:14Z"
  },
  {
    "author": "@magma_fire_bagwan",
    "text": "Bless the non-spoiler review, Jeremy! Will hopefully see this soon but we'll just see what happens",
    "publishedAt": "2024-02-21T23:00:55Z"
  },
  {
    "author": "@Kta8548i",
    "text": "2:42 watched an interview with the cast, and that was done on purpose",
    "publishedAt": "2024-02-21T22:59:55Z"
  },
  {
    "author": "@leighd4908",
    "text": "To be fair to everyone who worked on this movie, the final act in the book all happens very quickly, too. The action was just the mechanism for Paul’s development, not for its own sake.",
    "publishedAt": "2024-02-21T22:58:41Z"
  },
  {
    "author": "@iansnow450",
    "text": "I really like the new one, but Dune 84 will always have a special place in my heart, regardless of how messed up it is. That whole cast was amazing. Tried to get into the syfy channel’s Dune miniseries but just couldn’t.",
    "publishedAt": "2024-02-21T22:58:24Z"
  },
  {
    "author": "@1804Child",
    "text": "You're not going to do One Love, the Bob Marley movie?",
    "publishedAt": "2024-02-21T22:58:21Z"
  },
  {
    "author": "@sonicsnake44",
    "text": "This might be my favorite thumbnail of Jeremy's.",
    "publishedAt": "2024-02-21T22:58:07Z"
  },
  {
    "author": "@emperorsean1",
    "text": "It's not here in ireland until the 1st of March",
    "publishedAt": "2024-02-21T22:57:46Z"
  },
  {
    "author": "@ResidentWiseacre",
    "text": "Happy thumbnails from Jahns and Stuckmann.  This is gonna be great.",
    "publishedAt": "2024-02-21T22:55:03Z"
  },
  {
    "author": "@Nihm420",
    "text": "Alia!\nWhat about Alia??",
    "publishedAt": "2024-02-21T22:54:09Z"
  },
  {
    "author": "@Elijahhh.",
    "text": "Jeremy Jahns, please watch Attack On Titan, other media will disappoint after this masterpiece, this will not!",
    "publishedAt": "2024-02-21T22:53:18Z"
  },
  {
    "author": "@curtisjones6162",
    "text": "Scene all the dune movies after I read the book, not disappointed can’t wait to see dune2",
    "publishedAt": "2024-02-21T22:51:35Z"
  },
  {
    "author": "@Andres-yu4uf",
    "text": "What an excellent cast except for the two main protagonist",
    "publishedAt": "2024-02-21T22:51:10Z"
  },
  {
    "author": "@Triumph2727",
    "text": "I wonder if they’ll ever release a full uncut directors edition that’s like 7 hours long?",
    "publishedAt": "2024-02-21T22:50:56Z"
  },
  {
    "author": "@lordgonzo6611",
    "text": "Did this dude have to spoil Austin Butler killing a major character",
    "publishedAt": "2024-02-21T22:50:54Z"
  },
  {
    "author": "@TechVamp",
    "text": "That empire impersonation was great 😂",
    "publishedAt": "2024-02-21T22:50:24Z"
  },
  {
    "author": "@saraphys5555",
    "text": "7:18 Like when movies use to advertise that they had stop-motion animation by RAY HARRYHAUSEN... and somewhere in smaller type was the Director, main stars, etc...\nYeah, they need to bring back advertising ACTUAL talent...",
    "publishedAt": "2024-02-21T22:49:50Z"
  },
  {
    "author": "@orochimarupr",
    "text": "Dune is one of the worst movies ive ever seen",
    "publishedAt": "2024-02-21T22:48:36Z"
  },
  {
    "author": "@rafaelsays175",
    "text": "Christopher Walken impression on point 🎉",
    "publishedAt": "2024-02-21T22:44:50Z"
  },
  {
    "author": "@Questionthis1",
    "text": "2:03 Austin Butler as Theyd, Feyd-Rautha’s younger and more forgettable brother who isn’t as good as him at sports",
    "publishedAt": "2024-02-21T22:44:41Z"
  },
  {
    "author": "@jossell911",
    "text": "Great vid💯",
    "publishedAt": "2024-02-21T22:42:35Z"
  },
  {
    "author": "@andresgajardo9273",
    "text": "Zendaya and Timothée just don’t have enough gravitas imo",
    "publishedAt": "2024-02-21T22:42:20Z"
  },
  {
    "author": "@_JellyWalker",
    "text": "The comments about Chalamet being great in the build-up but not quite convincing as an actual leader - I felt the EXACT same thing about him in The King (2019).",
    "publishedAt": "2024-02-21T22:41:24Z"
  },
  {
    "author": "@stewpidaso1024",
    "text": "If Alia isn't in this movie and she isn't who kills the baron then fuck this movie.",
    "publishedAt": "2024-02-21T22:41:18Z"
  },
  {
    "author": "@devanmoran",
    "text": "may thy knife chip and shatter",
    "publishedAt": "2024-02-21T22:41:05Z"
  },
  {
    "author": "@Hayhoestudios",
    "text": "I loved Denise villanueve. that being said, watching dune part 1 was worse than watching paint dry. I'm hoping actual things happen in part 2. the one I'm most looking forward to seeing is Austin Butler",
    "publishedAt": "2024-02-21T22:35:57Z"
  },
  {
    "author": "@_JellyWalker",
    "text": "Respect for spotlighting the cinematographer!",
    "publishedAt": "2024-02-21T22:34:49Z"
  },
  {
    "author": "@sirg-had8821",
    "text": "Impeccable Walken impression",
    "publishedAt": "2024-02-21T22:34:20Z"
  },
  {
    "author": "@chrisi4581",
    "text": "I’ll see it if my theater has closed captions. I couldn’t hear a lot of dialogue in the first part and the loud score gave me hearing fatigue. I ripped my Blu-ray, boosted all of the dialogue, lowered the BWAAAAAAAAAAAA in the audio track and then I enjoyed the movie.",
    "publishedAt": "2024-02-21T22:33:26Z"
  },
  {
    "author": "@aja3longhorn375",
    "text": "Villanueve, Tarantino, and Nolan are the only directors making good blockbuster cinema still",
    "publishedAt": "2024-02-21T22:33:15Z"
  },
  {
    "author": "@shaunboone2335",
    "text": "You sound like Chris Steckmann😂",
    "publishedAt": "2024-02-21T22:31:34Z"
  },
  {
    "author": "@tekkblade82",
    "text": "I already want extended cuts of these two films.",
    "publishedAt": "2024-02-21T22:31:18Z"
  },
  {
    "author": "@prastagus3",
    "text": "maybe more of supporting characters in director's cut, if there is one",
    "publishedAt": "2024-02-21T22:28:14Z"
  },
  {
    "author": "@nickmattio3397",
    "text": "“>8•O SILENCE!!!!”",
    "publishedAt": "2024-02-21T22:26:44Z"
  },
  {
    "author": "@user-eb3dv6sd2h",
    "text": "Very much looking forward to see this one on the big screen. Hopefully we get a double feature in the future, just one long, beautiful masterpiece of a movie.",
    "publishedAt": "2024-02-21T22:25:58Z"
  },
  {
    "author": "@AeroDude73",
    "text": "Love when barely funny “reviewers” TRY overly hard to be funny and Fail.",
    "publishedAt": "2024-02-21T22:24:05Z"
  },
  {
    "author": "@bradrizzo3950",
    "text": "I didnt even know this was coming out, i wonder how.  First one was pretty ok.",
    "publishedAt": "2024-02-21T22:23:08Z"
  },
  {
    "author": "@codybischoff1010",
    "text": "So as far as Austin Butlers performance, he said he wanted his character to have the same mannerisms as the Barron because he’s been close by his side for so long so he takes after him in a lot of ways. Just some added context",
    "publishedAt": "2024-02-21T22:21:03Z"
  },
  {
    "author": "@3choblast3r4",
    "text": "I am 90% sure I will enjoy this movie. I'm 99% sure I would have enjoyed it more if I wasn't a dune fan. I love Villeneuve's movies, but it looks like Dennis changed a lot for this movie. And not for the better. Why the f would you make Chani the protagonist. Why would you make her doubt the prophecy. It's so dumb, it's clearly only done because of the people who don't know anything about Dune and assumed it's a \"white saviour movie.\" If you wanted to have some Fremen doubt the Atreides and the Prophecy, to set up the next movie. That's fine. That's a change I can live with. But Chani? That's a terrible person for that role.\n\nOh... yeah, I will probably definitely be someone who will be very disappointed after seeing this movie (I hope not). Since even Jeremy's review he talks about all the people who were complaining and talking about the changes from the books. It's *SO uneccesary, the books are incredibly good and the first movie was pretty faithfully adapted from the first half of the book, what possesed these people to make Chani the protagnist and change the story ffs, can't we EVER have a good adaptation of something*\n\np.s. as a bald man I take offense at the Harkonens all being bald. I wish they kept proper easthetic for Feyd. But I also wish they kept the baron a pederast. It's just part of the story and a good way to demonstrate how depraved he is.",
    "publishedAt": "2024-02-21T22:17:53Z"
  },
  {
    "author": "@joshuaflores1384",
    "text": "It's about time, I have been waiting for your review.",
    "publishedAt": "2024-02-21T22:14:57Z"
  },
  {
    "author": "@mjstory1976",
    "text": "Jeremy's 2024 Ratings Tally\n\nDogshit-3\nBetter When Drunk-2\nNot Going to Remember-1\nWorth Watching/Buying-1",
    "publishedAt": "2024-02-21T22:14:32Z"
  },
  {
    "author": "@Luxaron",
    "text": "Do people seriously ask if they need to watch part 1 first? It's like, yes, you do need to watch the first half of a movie before the second half. 😂",
    "publishedAt": "2024-02-21T22:13:30Z"
  },
  {
    "author": "@tristan-pi2gl",
    "text": "“I got a fever! And the only prescription! Is more Spice baby”",
    "publishedAt": "2024-02-21T22:13:22Z"
  },
  {
    "author": "@Lycan60606",
    "text": "Thank you for the video",
    "publishedAt": "2024-02-21T22:12:59Z"
  },
  {
    "author": "@zaczane",
    "text": "My favorite version of dune is warhammer 40k",
    "publishedAt": "2024-02-21T22:12:57Z"
  },
  {
    "author": "@chugg159",
    "text": "I have some problems with the first part. All of them are little things. But there are a lot of little things.",
    "publishedAt": "2024-02-21T22:12:46Z"
  },
  {
    "author": "@brucehouck7607",
    "text": "Excellent Christopher Walken impression!",
    "publishedAt": "2024-02-21T22:11:56Z"
  },
  {
    "author": "@trevorseeds1740",
    "text": "I just want to hear Christoper Walken say “the spice… uh… it must flow.”",
    "publishedAt": "2024-02-21T22:11:48Z"
  },
  {
    "author": "@neel23",
    "text": "My wishes were answered today when I was wondering when your Dune review would come out.  Definitely looking forward to seeing it when it comes out.",
    "publishedAt": "2024-02-21T22:10:09Z"
  },
  {
    "author": "@MysterySteve",
    "text": "I explicitly waited to see the first Dune because I heard how incomplete it feels without the upcoming sequel, and so now that we have both I will likely check them out",
    "publishedAt": "2024-02-21T22:06:07Z"
  },
  {
    "author": "@EyedMite",
    "text": "I have the audio book ! I want to get into it sooo bad but my issue is there is so many names and factions I lose track.",
    "publishedAt": "2024-02-21T22:01:56Z"
  },
  {
    "author": "@nickludovico6900",
    "text": "Wait so better then madame web?",
    "publishedAt": "2024-02-21T22:01:39Z"
  },
  {
    "author": "@Hoscitt",
    "text": "I'm not convinced. \n\nFirst one did nothing for me.   Although it was visually amazing and I am a Villeneuce fan just didn't find it engaging at all",
    "publishedAt": "2024-02-21T21:59:42Z"
  },
  {
    "author": "@andrewgroves3601",
    "text": "Please watch Mr Inbetween",
    "publishedAt": "2024-02-21T21:57:30Z"
  },
  {
    "author": "@donkey7577",
    "text": "The Traveler Worm & his interaction w/ The Emperor......\nWe need the Princess to narrate the recap",
    "publishedAt": "2024-02-21T21:54:17Z"
  },
  {
    "author": "@mellowthm566",
    "text": "I'm so excited 😅 but also worried people will hate Dune Messiah cuz they think it's a hero's journey. Kinda wish the emperor was not Walkins, he is supposed to look as young as the duke  cuz spice and loaded. But not sure who could act like Walkins tbh. Win some, lose some. Also yeah Tim Chalomet is gonna have a time acting Messiah since the character has uhhh a different vibe",
    "publishedAt": "2024-02-21T21:54:11Z"
  },
  {
    "author": "@Stalagmize",
    "text": "3:37 Yes! 😂",
    "publishedAt": "2024-02-21T21:53:44Z"
  },
  {
    "author": "@ShellBella1012",
    "text": "Can’t wait to see this movie!",
    "publishedAt": "2024-02-21T21:52:58Z"
  },
  {
    "author": "@yonaryhernandez1833",
    "text": "Haven't watched the first movie because of covid but I read the book hopefully I'm not too lost",
    "publishedAt": "2024-02-21T21:52:41Z"
  },
  {
    "author": "@spiraljumper74",
    "text": "I never really got psychopath from Feyd Rautha in the book, more like bored, hedonistic, spoiled, a little petulant even, but very skilled and intelligent.",
    "publishedAt": "2024-02-21T21:52:07Z"
  },
  {
    "author": "@SlimRhyno",
    "text": "I didn't think I could get more excited... and yet here I am, freaking the f out 🥴",
    "publishedAt": "2024-02-21T21:51:05Z"
  },
  {
    "author": "@sungkim742",
    "text": "I wish Christopher Watkins would have done his Balls of Fury character in this movie.",
    "publishedAt": "2024-02-21T21:49:49Z"
  },
  {
    "author": "@blairdavis4734",
    "text": "I have grown to appreciate your reviews much more than I would a Stuckmann pointless review",
    "publishedAt": "2024-02-21T21:49:46Z"
  },
  {
    "author": "@Chi11monger",
    "text": "Is he calling Feyd Theyd?",
    "publishedAt": "2024-02-21T21:49:15Z"
  },
  {
    "author": "@Ladmia",
    "text": "I’m treating Dune like the LOTR franchise.  The books will always have more content and depth, but as long as the main beats and tone is there, I can view the movies as a stand alone.  Going to be seeing it at the Fan first event.",
    "publishedAt": "2024-02-21T21:49:13Z"
  },
  {
    "author": "@derekholland3328",
    "text": "Barron pushed to the back? Nooooo!",
    "publishedAt": "2024-02-21T21:48:31Z"
  },
  {
    "author": "@mikebean.",
    "text": "March 1 i will be in the theater",
    "publishedAt": "2024-02-21T21:48:16Z"
  },
  {
    "author": "@pikadasgalaxias306",
    "text": "I don't know if it's my favourite iteration of Dune, but Dune: Redux the Alternative Edition by Spicediver is AMAZING!",
    "publishedAt": "2024-02-21T21:43:49Z"
  },
  {
    "author": "@hamzakhairi4765",
    "text": "I think the book dune really underplays his and chani's love. This makes the dynamics in dune messiah seem weird placing a huge emphasis on their relationship",
    "publishedAt": "2024-02-21T21:43:24Z"
  },
  {
    "author": "@jumpingman8160",
    "text": "Lynch's version is the best (except the ending)",
    "publishedAt": "2024-02-21T21:41:48Z"
  },
  {
    "author": "@aishaalamoudi599",
    "text": "I've heard mix reviews of this film so far.",
    "publishedAt": "2024-02-21T21:40:47Z"
  },
  {
    "author": "@DarkLadyAthena1",
    "text": "I want to see this so bad! Dune is one of my all time favorite science fiction sagas.\nI am so jealous you got to see this. \nDenis is a great director.",
    "publishedAt": "2024-02-21T21:39:44Z"
  },
  {
    "author": "@tylerskiss",
    "text": "It’s rare to get a good Walken impersonation complete with the end growl. Well done Jeremy🫡",
    "publishedAt": "2024-02-21T21:39:38Z"
  },
  {
    "author": "@lupolinar",
    "text": "Double Feature incomming! only 7 days to go...",
    "publishedAt": "2024-02-21T21:38:46Z"
  },
  {
    "author": "@muaddibnelson",
    "text": "My most anticipated film of the year! I loved this review! I’m seeing on Sunday!!",
    "publishedAt": "2024-02-21T21:38:39Z"
  },
  {
    "author": "@cteal2018",
    "text": "Waiting for the 7 hour director's cut for both movies.",
    "publishedAt": "2024-02-21T21:38:22Z"
  },
  {
    "author": "@user-fg3bn6nj8v",
    "text": "I don’t like those books because it’s like remembering forward.",
    "publishedAt": "2024-02-21T21:36:51Z"
  },
  {
    "author": "@alexanderkirk3126",
    "text": "4:09 clearly you know nothing about frank herbert or his works; the story of paul atriedes is a variation of jesus christ! The books delve heavily into religion; theology, sociology, spirtuality, philosophy and the bible",
    "publishedAt": "2024-02-21T21:36:47Z"
  },
  {
    "author": "@tomw.6757",
    "text": "I just can't take timothee chalamet seriously. He looks like an 11-year-old child.",
    "publishedAt": "2024-02-21T21:36:45Z"
  },
  {
    "author": "@RosendalTV",
    "text": "Can't wait to watch this one :)",
    "publishedAt": "2024-02-21T21:35:40Z"
  },
  {
    "author": "@sylnz97",
    "text": "already got my ticket for the double feature, fuckin 5h of dune in one go I'm so ready...",
    "publishedAt": "2024-02-21T21:35:38Z"
  },
  {
    "author": "@mariap.2822",
    "text": "Sorry, not impressed with the review I I wonder if you have actually seen the movie",
    "publishedAt": "2024-02-21T21:35:13Z"
  },
  {
    "author": "@yeahnah2918",
    "text": "Dune pt 1 and 2\nArrival \nBlade Runner 2049 \nThis guy is a modern day Sci Fi genius",
    "publishedAt": "2024-02-21T21:34:42Z"
  },
  {
    "author": "@drunkdonutboy",
    "text": "Wow this has been the most lukewarm review",
    "publishedAt": "2024-02-21T21:34:00Z"
  },
  {
    "author": "@deenaprice1524",
    "text": "Ok, a Jeremy endorsement is nice... Now let's see what the audience says. 🧐",
    "publishedAt": "2024-02-21T21:32:32Z"
  },
  {
    "author": "@za316653",
    "text": "Betting on a 125 million dollar opening weekend!",
    "publishedAt": "2024-02-21T21:30:03Z"
  },
  {
    "author": "@woyame1",
    "text": "I liked your review, and I think I'm going to like the movie, but MAN! - Your Christopher Walken impersonation is a thing of perfection!",
    "publishedAt": "2024-02-21T21:29:06Z"
  },
  {
    "author": "@VGB791",
    "text": "Just hope the third one doesn't suffer the same fate as  all the third one is always 😞 bad",
    "publishedAt": "2024-02-21T21:26:59Z"
  },
  {
    "author": "@soundofprice",
    "text": "seems like its going to suck again",
    "publishedAt": "2024-02-21T21:26:58Z"
  },
  {
    "author": "@joshwilsoncomedy",
    "text": "Harkonnen the Barbarian",
    "publishedAt": "2024-02-21T21:26:55Z"
  },
  {
    "author": "@iama14carat",
    "text": "I felt dune part 1 was boring",
    "publishedAt": "2024-02-21T21:26:25Z"
  },
  {
    "author": "@EvolvementEras",
    "text": "And this is why I haven’t touched the novel in a while bc I didn’t want to compare the two",
    "publishedAt": "2024-02-21T21:25:34Z"
  },
  {
    "author": "@OwenFriday13",
    "text": "Imo, Tim would have made a good Leto II but oh well. Wonder who they'll cast as. Better yet, at this rate, would we get to God Emperor finally?",
    "publishedAt": "2024-02-21T21:25:12Z"
  },
  {
    "author": "@kisekhan2818",
    "text": "3 questions \nIs there a part three coming or is this it \nDid they do the pual has a baby and bye bye baby\nAn is pual finally have abbs",
    "publishedAt": "2024-02-21T21:24:19Z"
  },
  {
    "author": "@jamaldee2355",
    "text": "I’m Definitely going to watch part one again the same day that I go see part 2 in theatres",
    "publishedAt": "2024-02-21T21:24:10Z"
  },
  {
    "author": "@vincentpuccio3689",
    "text": "You obviously haven’t read the books it’s all religion",
    "publishedAt": "2024-02-21T21:22:42Z"
  },
  {
    "author": "@N3RFTHIS",
    "text": "Part 1 looked great, but it was booooring.",
    "publishedAt": "2024-02-21T21:22:24Z"
  },
  {
    "author": "@BlackMambaFan124",
    "text": "I’ll never understand the hype of this franchise",
    "publishedAt": "2024-02-21T21:21:15Z"
  },
  {
    "author": "@kimcage7768",
    "text": "Timothee Chalamet is so ferocious, a real boy's boy ❤",
    "publishedAt": "2024-02-21T21:19:11Z"
  },
  {
    "author": "@ronmosely8355",
    "text": "Who ever went to see Moby Dick without at least knowing about the book?",
    "publishedAt": "2024-02-21T21:19:05Z"
  },
  {
    "author": "@waziotter",
    "text": "So it’s Game Of Thrones… IN SPAAAAACE!",
    "publishedAt": "2024-02-21T21:18:30Z"
  },
  {
    "author": "@XeroFailGames",
    "text": "So much from the new ones is pulled from the 80s movie",
    "publishedAt": "2024-02-21T21:17:00Z"
  },
  {
    "author": "@kelvinbrank4756",
    "text": "1st one was so boring I don't remember what happened",
    "publishedAt": "2024-02-21T21:15:55Z"
  },
  {
    "author": "@Nejineto",
    "text": "If I fell asleep in part one should I watch part two?",
    "publishedAt": "2024-02-21T21:14:27Z"
  },
  {
    "author": "@El_Guapo98",
    "text": "Spicebros….we are so insanely back",
    "publishedAt": "2024-02-21T21:14:00Z"
  },
  {
    "author": "@jamez6398",
    "text": "Best looking movies would be Drive, Blade Runner 2049, Dune, The Tree of Life, and The Creator.",
    "publishedAt": "2024-02-21T21:13:47Z"
  },
  {
    "author": "@tbhreviews6611",
    "text": "So it’s only a 2 parter ? No part 3 ?",
    "publishedAt": "2024-02-21T21:13:21Z"
  },
  {
    "author": "@EMO_alpha",
    "text": "I just watched the original for the 1st time. Pretty good friggin' movie.",
    "publishedAt": "2024-02-21T21:09:42Z"
  },
  {
    "author": "@ubermalice9589",
    "text": "Good review. GREAT hair. I envy the full beard. Typically full beard means not great hair. You just have it all, don't you. Mmmm. That was a quick change in tone. Anyway. Cheers! To Dune part 2 and great hair.",
    "publishedAt": "2024-02-21T21:08:08Z"
  },
  {
    "author": "@deltavagen9796",
    "text": "watching because of zendaya",
    "publishedAt": "2024-02-21T21:08:03Z"
  },
  {
    "author": "@mikepeterson4061",
    "text": "how do i watch this right now?",
    "publishedAt": "2024-02-21T21:05:44Z"
  },
  {
    "author": "@MrHimura",
    "text": "Dune is white people Wakanda.",
    "publishedAt": "2024-02-21T21:05:12Z"
  },
  {
    "author": "@larsthomasdenstad9082",
    "text": "I though the first was worse than any other incarnation I've seen, and I've seen most. Will not see this unless it is forced on me at gunpoint.",
    "publishedAt": "2024-02-21T21:04:56Z"
  },
  {
    "author": "@MySamurai77",
    "text": "Why are all the Harkonen bald?  They are supposed to have red hair.",
    "publishedAt": "2024-02-21T21:03:15Z"
  },
  {
    "author": "@zachkeenankacey4945",
    "text": "Baller",
    "publishedAt": "2024-02-21T21:01:50Z"
  },
  {
    "author": "@superproducercbiz",
    "text": "The action ?… was it good or……",
    "publishedAt": "2024-02-21T21:01:15Z"
  },
  {
    "author": "@STTPMASFTNE",
    "text": "Greg Fraiser also did Rogue One. Amazing work.",
    "publishedAt": "2024-02-21T21:00:45Z"
  },
  {
    "author": "@WallStreet_MadeMe",
    "text": "Can’t wait to see this film lfg",
    "publishedAt": "2024-02-21T21:00:35Z"
  },
  {
    "author": "@whitest_rabbit69",
    "text": "Of its 3 hrs long. Im not gonna watch it in a theater. First one was lame.",
    "publishedAt": "2024-02-21T20:59:34Z"
  },
  {
    "author": "@klintbeastwould2370",
    "text": "Awesome review as only, major bonus points for s-tier impressions",
    "publishedAt": "2024-02-21T20:58:59Z"
  },
  {
    "author": "@Vinsternator40",
    "text": "Greg Fraser and Roger Deakins have quickly become my favorite cinematographers ever in the industry",
    "publishedAt": "2024-02-21T20:57:56Z"
  },
  {
    "author": "@nicholasnajibi3082",
    "text": "So the movie sucks but it’s just pretty to look at…pretty much like the first one",
    "publishedAt": "2024-02-21T20:57:18Z"
  },
  {
    "author": "@Historybuffmuppet",
    "text": "Will there be a part 3",
    "publishedAt": "2024-02-21T20:56:35Z"
  },
  {
    "author": "@rogersam1294",
    "text": "I'll see it if someone buys me the ticket.",
    "publishedAt": "2024-02-21T20:56:08Z"
  },
  {
    "author": "@luiscorreia5095",
    "text": "Is there a part 3 or does it end at 2?",
    "publishedAt": "2024-02-21T20:55:25Z"
  },
  {
    "author": "@adamJKpunk",
    "text": "I couldn’t stay awake during either one of these movies lol.",
    "publishedAt": "2024-02-21T20:55:19Z"
  },
  {
    "author": "@technauseated4208",
    "text": "I may actually go watch it at the theater, but not opening night. Funny that you mention getting it on disc, I have noticed all the stores are drastically shrinking their movie sections. Best Buy will quit carrying them altogether soon. Hopefully we can still buy the 4K blu rays online, I'm definitely not ready for the digital-only non-choice.",
    "publishedAt": "2024-02-21T20:52:45Z"
  },
  {
    "author": "@xxtextraextrathirsty8119",
    "text": "i remember i told my self.. im never watching that movie again \"BUNE  part 1\" that is.. and i keep my word",
    "publishedAt": "2024-02-21T20:52:43Z"
  },
  {
    "author": "@CNC295",
    "text": "I'll just wait for the director's cut and get the full 3 hours 45 minutes",
    "publishedAt": "2024-02-21T20:52:11Z"
  },
  {
    "author": "@elidragom",
    "text": "how tf you a movie critic n say hollywood has a phobia of love stories?? \nshit has been baked into most movies & tv shows at some or many points since the inception of film",
    "publishedAt": "2024-02-21T20:52:02Z"
  },
  {
    "author": "@thousandyeargems4360",
    "text": "Im so pumped to see them do the last 3 chapters of the book.\nPaul vs Feyd Rautha is gonna be amazing",
    "publishedAt": "2024-02-21T20:51:56Z"
  },
  {
    "author": "@KillerTacos54",
    "text": "So excited to watch this in 1570 IMAX!!",
    "publishedAt": "2024-02-21T20:51:48Z"
  },
  {
    "author": "@jiggygrand",
    "text": "Your Christopher Walkin is funny and SPOT ON!!!",
    "publishedAt": "2024-02-21T20:50:16Z"
  },
  {
    "author": "@ModernTraveler",
    "text": "Right as you said “I know you hard copy purists; you know what it’s all about” I was literally unboxing my latest 4K and HD movie haul from Amazon. lol\nI SURE DO, JEREMY. I SURE DO.",
    "publishedAt": "2024-02-21T20:49:35Z"
  },
  {
    "author": "@kevkev3797",
    "text": "Watched part 1. Didn't care for it.",
    "publishedAt": "2024-02-21T20:49:11Z"
  },
  {
    "author": "@michaelgreene4816",
    "text": "I've heard that this was/is the best Star Wars movie since \"Empire\" Challenge sent DISNEY.\n\nDune is better than SW right now.",
    "publishedAt": "2024-02-21T20:49:07Z"
  },
  {
    "author": "@JidionisthebiggestMenace",
    "text": "Great review bro",
    "publishedAt": "2024-02-21T20:48:21Z"
  },
  {
    "author": "@maybehuman2148",
    "text": "Even Star Wars knew to get off the desert planet fast. This is now the second \"space\" movie set entirely on a desert planet. 🥱",
    "publishedAt": "2024-02-21T20:46:54Z"
  },
  {
    "author": "@Ellipsis10",
    "text": "The sleeper has awakened",
    "publishedAt": "2024-02-21T20:46:43Z"
  },
  {
    "author": "@RookE2011",
    "text": "Regarding the book - I'm convinced that Dune movies are in one of the possible futures that Paul sees. In the books it's noted he sees possible futures and that the visions he sees will not always pass. \n\nI'm definitely reaching but...I am convinced nonetheless",
    "publishedAt": "2024-02-21T20:46:06Z"
  },
  {
    "author": "@alwaystakemarktwainsadvice4269",
    "text": "Hollywood doesn’t have a phobia of romance, you just don’t like them. Which is fine, but let’s not pretend “YA” romance is something different than any other romance including in Dune.",
    "publishedAt": "2024-02-21T20:43:06Z"
  },
  {
    "author": "@slate49",
    "text": "Yes! Stoked!",
    "publishedAt": "2024-02-21T20:43:00Z"
  },
  {
    "author": "@emilianohermosilla3996",
    "text": "Ok I’m gonna say it. We’ll probably be needing the 24 hour definite edition from Dennis Villanueve 😅😂",
    "publishedAt": "2024-02-21T20:42:45Z"
  },
  {
    "author": "@mediabymario",
    "text": "Does Jeremy have a Letterboxd? is he too old for that? or is his youtube channel his \"letterboxd\" lol?",
    "publishedAt": "2024-02-21T20:41:32Z"
  },
  {
    "author": "@laurabuckles7961",
    "text": "Did Gurney write a creepy poem about Paul?",
    "publishedAt": "2024-02-21T20:40:25Z"
  },
  {
    "author": "@braedenmartin8596",
    "text": "Yeah this is sounds like a hunger games YA novel",
    "publishedAt": "2024-02-21T20:39:55Z"
  },
  {
    "author": "@rubeng370",
    "text": "I've been most hyped this year for Dune 2 and Kingdom of the Planet of the Apes 😮",
    "publishedAt": "2024-02-21T20:39:50Z"
  },
  {
    "author": "@johnscott6481",
    "text": "Rendezvous with rama is next right?",
    "publishedAt": "2024-02-21T20:38:53Z"
  },
  {
    "author": "@Percy.cooks6",
    "text": "So is madame web better?",
    "publishedAt": "2024-02-21T20:38:40Z"
  },
  {
    "author": "@cable7152",
    "text": "If the thought of Denis V making a shitty young adult love story entered your brain for even one second, that's a you problem.",
    "publishedAt": "2024-02-21T20:38:08Z"
  },
  {
    "author": "@mritunjaymusale",
    "text": "You say watch on bluray, let me tell ya the bluray will be 3hr15mins and will have more content to flush out the story properly,which will make it awesomtacular.",
    "publishedAt": "2024-02-21T20:35:59Z"
  },
  {
    "author": "@ThemBakerboys",
    "text": "This is the only movie this year I care about.  And I care a lot.",
    "publishedAt": "2024-02-21T20:35:51Z"
  },
  {
    "author": "@Fabonj",
    "text": "The best part of the movie is when Paul turns to Baron Harkonnen and says \"Hey Barron! Atreideez nuts!\" before absolutely wrecking his shit.",
    "publishedAt": "2024-02-21T20:34:55Z"
  },
  {
    "author": "@TVGGAMEZCO",
    "text": "not a bad impression of walken lol",
    "publishedAt": "2024-02-21T20:33:34Z"
  },
  {
    "author": "@walkswithgus8391",
    "text": "Really hoping there is a doubleheader at my theater when this comes out. I missed out on seeing part one in theaters.",
    "publishedAt": "2024-02-21T20:33:15Z"
  },
  {
    "author": "@KoFuZzY1",
    "text": "to be fair, most of the characters  in this don't have a lot of time on the page either",
    "publishedAt": "2024-02-21T20:32:39Z"
  },
  {
    "author": "@HeavensCalamity",
    "text": "Does Zendaya really get THAT much screen time? Chani really did not have that much in the book.",
    "publishedAt": "2024-02-21T20:31:38Z"
  },
  {
    "author": "@joesmith201212",
    "text": "Evil spiderman did a great Dune 2 review good job Evil Spiderman!",
    "publishedAt": "2024-02-21T20:30:14Z"
  },
  {
    "author": "@josephg6540",
    "text": "Dune 😂 get out of here",
    "publishedAt": "2024-02-21T20:29:57Z"
  },
  {
    "author": "@jaredmcomber",
    "text": "I will not be watching this hot pile of crap",
    "publishedAt": "2024-02-21T20:29:41Z"
  },
  {
    "author": "@madgrimmer",
    "text": "Will D’une bé a trilogy?",
    "publishedAt": "2024-02-21T20:29:06Z"
  },
  {
    "author": "@katevand",
    "text": "Deux is good? good",
    "publishedAt": "2024-02-21T20:28:55Z"
  },
  {
    "author": "@WilliamEggington",
    "text": "Keep Dune Weird!",
    "publishedAt": "2024-02-21T20:28:32Z"
  },
  {
    "author": "@studentstudent5044",
    "text": "Didkt even know the movie was out yet",
    "publishedAt": "2024-02-21T20:27:53Z"
  },
  {
    "author": "@madgrimmer",
    "text": "Not unlike «Once Upon a Time In Mexico » where Johnny Depp had to shoot the chef for being too good at his job, someone had better tell the cinematographer of « Dune » to watch his back!",
    "publishedAt": "2024-02-21T20:27:45Z"
  },
  {
    "author": "@franzferdinand5810",
    "text": "Also Greg Fraser was director of photograpgy for Rogue One!",
    "publishedAt": "2024-02-21T20:27:27Z"
  },
  {
    "author": "@worlddd7777",
    "text": "And most funny thing is that main character of Dune universe isnt even born yet in book one.",
    "publishedAt": "2024-02-21T20:26:45Z"
  },
  {
    "author": "@scottaddison694",
    "text": "Chalemet potrays paul so perfectly you almost forget he kills 17+ billion people which is the whole point of the first book. The charisma has you rooting for someone thats evil. So fucking perfect",
    "publishedAt": "2024-02-21T20:24:31Z"
  },
  {
    "author": "@zoebaggins90",
    "text": "The first one was completely sterile, fake and soulless. I actually prefer Lynch's Dune.",
    "publishedAt": "2024-02-21T20:24:17Z"
  },
  {
    "author": "@millsfinancialgroup",
    "text": "My gripe about part 1 was that it was boring. I'll pass on part 2.",
    "publishedAt": "2024-02-21T20:23:07Z"
  },
  {
    "author": "@ENTERtheCREATOR",
    "text": "Favorite? Dune 2000 of course.",
    "publishedAt": "2024-02-21T20:22:44Z"
  },
  {
    "author": "@aaronhoilett9789",
    "text": "Review Bob Marley bro",
    "publishedAt": "2024-02-21T20:22:32Z"
  },
  {
    "author": "@LuigiTuazon",
    "text": "Ezekiel Sims is a Youtuber?",
    "publishedAt": "2024-02-21T20:21:18Z"
  },
  {
    "author": "@sundanceKid47",
    "text": "Kathleen Kennedy is gonna shit in her pants watching this movie.",
    "publishedAt": "2024-02-21T20:20:28Z"
  },
  {
    "author": "@RoundtreeattheGrosvernor",
    "text": "Har-Cone-En is correct, well done Jeramy",
    "publishedAt": "2024-02-21T20:20:06Z"
  }
]
